-- phpMyAdmin SQL Dump
-- version 4.7.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2017-11-12 14:42:52
-- 服务器版本： 5.7.11
-- PHP Version: 7.0.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `xyhcms`
--

-- --------------------------------------------------------

--
-- 表的结构 `yy_abc`
--

DROP TABLE IF EXISTS `yy_abc`;
CREATE TABLE `yy_abc` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL,
  `remark` varchar(50) DEFAULT '',
  `width` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `height` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `setting` varchar(200) NOT NULL DEFAULT '',
  `type` tinyint(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '类型',
  `num` tinyint(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '调用数',
  `items` smallint(4) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_abc`
--

INSERT INTO `yy_abc` (`id`, `name`, `remark`, `width`, `height`, `setting`, `type`, `num`, `items`) VALUES
(1, '首页幻灯', '首页', 722, 257, '<loop><li><a href=\"{$url}\"><img src=\"{$content}\" width=\"{$width}\" height=\"{$height}\" /></a></li></loop>', 2, 2, 2),
(2, '55555', '66666', 0, 0, '<loop><embed src=\"{$content}\" quality=\"high\" width=\"{$width}\" height=\"{$height}\" wmode=\"opaque\" type=\"application/x-shockwave-flash\"></embed></loop>', 3, 1, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_abc_detail`
--

DROP TABLE IF EXISTS `yy_abc_detail`;
CREATE TABLE `yy_abc_detail` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(60) NOT NULL DEFAULT '',
  `content` varchar(255) NOT NULL DEFAULT '',
  `url` varchar(200) NOT NULL DEFAULT '',
  `start_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `end_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `sort` smallint(5) NOT NULL DEFAULT '0',
  `status` tinyint(1) UNSIGNED DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_abc_detail`
--

INSERT INTO `yy_abc_detail` (`id`, `title`, `content`, `url`, `start_time`, `end_time`, `aid`, `sort`, `status`) VALUES
(1, '图片1', 'http://img9.xyhcms.com/banner/p1.jpg', '#', '2014-11-18 10:00:00', '2030-12-31 10:00:00', 1, 1, 1),
(2, '图片2', 'http://img9.xyhcms.com/banner/p2.jpg', '#', '2014-11-18 10:00:00', '2030-12-31 10:00:00', 1, 1, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_active`
--

DROP TABLE IF EXISTS `yy_active`;
CREATE TABLE `yy_active` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `type` tinyint(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '类型',
  `code` varchar(11) NOT NULL DEFAULT '' COMMENT '激活码',
  `expire` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `email` varchar(50) NOT NULL DEFAULT '',
  `update_time` datetime DEFAULT NULL COMMENT '更新时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_active`
--

INSERT INTO `yy_active` (`id`, `user_id`, `type`, `code`, `expire`, `email`, `update_time`) VALUES
(1, 1, 0, '7ZmGwhTZFyX', 1498139744, '', '1970-01-01 08:00:00'),
(2, 2, 0, 'j9HX5k4YATt', 1507474048, '', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `yy_admin`
--

DROP TABLE IF EXISTS `yy_admin`;
CREATE TABLE `yy_admin` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(20) NOT NULL DEFAULT '' COMMENT '登录名',
  `password` varchar(32) NOT NULL DEFAULT '' COMMENT '密码',
  `encrypt` varchar(6) NOT NULL DEFAULT '',
  `department` varchar(255) DEFAULT '' COMMENT '部门',
  `realname` varchar(20) NOT NULL DEFAULT '',
  `email` varchar(100) NOT NULL DEFAULT '',
  `user_type` tinyint(4) NOT NULL DEFAULT '0',
  `login_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `login_ip` varchar(30) NOT NULL DEFAULT '' COMMENT '登录IP',
  `is_lock` tinyint(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '锁定状态',
  `login_num` int(11) DEFAULT '0' COMMENT '登录次数'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='网站后台管理员表';

--
-- 转存表中的数据 `yy_admin`
--

INSERT INTO `yy_admin` (`id`, `username`, `password`, `encrypt`, `department`, `realname`, `email`, `user_type`, `login_time`, `login_ip`, `is_lock`, `login_num`) VALUES
(1, 'xyhcms', 'c5140e4b33a6e3b45e7fac1d8059b6f4', 'wSDRJn', '3', '', '', 9, '2017-10-16 17:39:14', '127.0.0.1', 0, 33),
(2, 'zhao', '357bf4c34d567427b1106ccade59dcdd', 'VbCpH1', '1,4', '小赵', 'zhao@163.com', 0, '2017-08-17 21:12:36', '127.0.0.1', 0, 21);

-- --------------------------------------------------------

--
-- 表的结构 `yy_announce`
--

DROP TABLE IF EXISTS `yy_announce`;
CREATE TABLE `yy_announce` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL,
  `content` text NOT NULL,
  `start_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '开始时间',
  `end_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '结束时间',
  `post_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '添加时间',
  `status` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_announce`
--

INSERT INTO `yy_announce` (`id`, `title`, `content`, `start_time`, `end_time`, `post_time`, `status`) VALUES
(1, '手机版网站开通', '<p>手机版网站开通，用手机版网站开通手机访问http://demo.0871k.com 即可访问手机站</p>', '1970-01-01 08:00:00', '2018-04-30 08:36:00', '2014-04-02 08:36:54', 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_area`
--

DROP TABLE IF EXISTS `yy_area`;
CREATE TABLE `yy_area` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL DEFAULT '',
  `sname` varchar(10) NOT NULL DEFAULT '' COMMENT '简称',
  `ename` varchar(50) NOT NULL DEFAULT '',
  `pid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `sort` int(10) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_area`
--

INSERT INTO `yy_area` (`id`, `name`, `sname`, `ename`, `pid`, `sort`) VALUES
(1, '北京市', '北京', '', 0, 0),
(2, '上海市', '上海', '', 0, 0),
(3, '天津市', '天津', '', 0, 0),
(4, '重庆市', '重庆', '', 0, 0),
(5, '广东省', '广东', '', 0, 0),
(6, '福建省', '福建', '', 0, 0),
(7, '浙江省', '浙江', '', 0, 0),
(8, '江苏省', '江苏', '', 0, 0),
(9, '山东省', '山东', '', 0, 0),
(10, '辽宁省', '辽宁', '', 0, 0),
(11, '江西省', '江西', '', 0, 0),
(12, '四川省', '四川', '', 0, 0),
(13, '陕西省', '陕西', '', 0, 0),
(14, '湖北省', '湖北', '', 0, 0),
(15, '河南省', '河南', '', 0, 0),
(16, '河北省', '河北', '', 0, 0),
(17, '山西省', '山西', '', 0, 0),
(18, '内蒙古', '内蒙古', '', 0, 0),
(19, '吉林省', '吉林', '', 0, 0),
(20, '黑龙江', '黑龙江', '', 0, 0),
(21, '安徽省', '安徽', '', 0, 0),
(22, '湖南省', '湖南', '', 0, 0),
(23, '广西', '广西', '', 0, 0),
(24, '海南省', '海南', '', 0, 0),
(25, '云南省', '云南', '', 0, 0),
(26, '贵州省', '贵州', '', 0, 0),
(27, '西藏', '西藏', '', 0, 0),
(28, '甘肃省', '甘肃', '', 0, 0),
(29, '宁夏区', '宁夏区', '', 0, 0),
(30, '青海省', '青海', '', 0, 0),
(31, '新疆', '新疆', '', 0, 0),
(32, '香港', '香港', '', 0, 0),
(33, '澳门', '澳门', '', 0, 0),
(34, '台湾省', '台湾', '', 0, 0),
(60, '海外', '海外', '', 0, 0),
(101, '东城区', '东城区', '', 1, 0),
(102, '西城区', '西城区', '', 1, 0),
(103, '崇文区', '崇文区', '', 1, 0),
(104, '宣武区', '宣武区', '', 1, 0),
(105, '朝阳区', '朝阳区', '', 1, 0),
(106, '海淀区', '海淀区', '', 1, 0),
(107, '丰台区', '丰台区', '', 1, 0),
(108, '石景山区', '石景山区', '', 1, 0),
(109, '门头沟区', '门头沟区', '', 1, 0),
(110, '房山区', '房山区', '', 1, 0),
(111, '通州区', '通区', '', 1, 0),
(112, '顺义区', '顺义区', '', 1, 0),
(113, '昌平区', '昌平区', '', 1, 0),
(114, '大兴区', '大兴区', '', 1, 0),
(115, '平谷县', '平谷县', '', 1, 0),
(116, '怀柔县', '怀柔县', '', 1, 0),
(117, '密云县', '密云县', '', 1, 0),
(118, '延庆县', '延庆县', '', 1, 0),
(201, '黄浦区', '黄浦区', '', 2, 0),
(202, '卢湾区', '卢湾区', '', 2, 0),
(203, '徐汇区', '徐汇区', '', 2, 0),
(204, '长宁区', '长宁区', '', 2, 0),
(205, '静安区', '静安区', '', 2, 0),
(206, '普陀区', '普陀区', '', 2, 0),
(207, '闸北区', '闸北区', '', 2, 0),
(208, '虹口区', '虹口区', '', 2, 0),
(209, '杨浦区', '杨浦区', '', 2, 0),
(210, '宝山区', '宝山区', '', 2, 0),
(211, '闵行区', '闵行区', '', 2, 0),
(212, '嘉定区', '嘉定区', '', 2, 0),
(213, '浦东新区', '浦东新区', '', 2, 0),
(214, '松江区', '松江区', '', 2, 0),
(215, '金山区', '金山区', '', 2, 0),
(216, '青浦区', '青浦区', '', 2, 0),
(217, '南汇区', '南汇区', '', 2, 0),
(218, '奉贤区', '奉贤区', '', 2, 0),
(219, '崇明县', '崇明县', '', 2, 0),
(301, '和平区', '和平区', '', 3, 0),
(302, '河东区', '河东区', '', 3, 0),
(303, '河西区', '河西区', '', 3, 0),
(304, '南开区', '南开区', '', 3, 0),
(305, '河北区', '河北区', '', 3, 0),
(306, '红桥区', '红桥区', '', 3, 0),
(307, '塘沽区', '塘沽区', '', 3, 0),
(308, '汉沽区', '汉沽区', '', 3, 0),
(309, '大港区', '大港区', '', 3, 0),
(310, '东丽区', '东丽区', '', 3, 0),
(311, '西青区', '西青区', '', 3, 0),
(312, '北辰区', '北辰区', '', 3, 0),
(313, '津南区', '津南区', '', 3, 0),
(314, '武清区', '武清区', '', 3, 0),
(315, '宝坻区', '宝坻区', '', 3, 0),
(316, '静海县', '静海县', '', 3, 0),
(317, '宁河县', '宁河县', '', 3, 0),
(318, '蓟县', '蓟县', '', 3, 0),
(401, '渝中区', '渝中区', '', 4, 0),
(402, '大渡口区', '大渡口区', '', 4, 0),
(403, '江北区', '江北区', '', 4, 0),
(404, '沙坪坝区', '沙坪坝区', '', 4, 0),
(405, '九龙坡区', '九龙坡区', '', 4, 0),
(406, '南岸区', '南岸区', '', 4, 0),
(407, '北碚区', '北碚区', '', 4, 0),
(408, '万盛区', '万盛区', '', 4, 0),
(409, '双桥区', '双桥区', '', 4, 0),
(410, '渝北区', '渝北区', '', 4, 0),
(411, '巴南区', '巴南区', '', 4, 0),
(412, '万州区', '万区', '', 4, 0),
(413, '涪陵区', '涪陵区', '', 4, 0),
(414, '黔江区', '黔江区', '', 4, 0),
(415, '永川市', '永川', '', 4, 0),
(416, '合川市', '合川', '', 4, 0),
(417, '江津市', '江津', '', 4, 0),
(418, '南川市', '南川', '', 4, 0),
(419, '长寿县', '长寿县', '', 4, 0),
(420, '綦江县', '綦江县', '', 4, 0),
(421, '潼南县', '潼南县', '', 4, 0),
(422, '荣昌县', '荣昌县', '', 4, 0),
(423, '璧山县', '璧山县', '', 4, 0),
(424, '大足县', '大足县', '', 4, 0),
(425, '铜梁县', '铜梁县', '', 4, 0),
(426, '梁平县', '梁平县', '', 4, 0),
(427, '城口县', '城口县', '', 4, 0),
(428, '垫江县', '垫江县', '', 4, 0),
(429, '武隆县', '武隆县', '', 4, 0),
(430, '丰都县', '丰都县', '', 4, 0),
(431, '奉节县', '奉节县', '', 4, 0),
(432, '开县', '开县', '', 4, 0),
(433, '云阳县', '云阳县', '', 4, 0),
(434, '忠县', '忠县', '', 4, 0),
(435, '巫溪县', '巫溪县', '', 4, 0),
(436, '巫山县', '巫山县', '', 4, 0),
(437, '石柱县', '石柱县', '', 4, 0),
(438, '秀山县', '秀山县', '', 4, 0),
(439, '酉阳县', '酉阳县', '', 4, 0),
(440, '彭水县', '彭水县', '', 4, 0),
(501, '广州市', '广州', '', 5, 0),
(502, '深圳市', '深圳', '', 5, 0),
(503, '珠海市', '珠海', '', 5, 0),
(504, '汕头市', '汕头', '', 5, 0),
(505, '韶关市', '韶关', '', 5, 0),
(506, '河源市', '河源', '', 5, 0),
(507, '梅州市', '梅州', '', 5, 0),
(508, '惠州市', '惠州', '', 5, 0),
(509, '汕尾市', '汕尾', '', 5, 0),
(510, '东莞市', '东莞', '', 5, 0),
(511, '中山市', '中山', '', 5, 0),
(512, '江门市', '江门', '', 5, 0),
(513, '佛山市', '佛山', '', 5, 0),
(514, '阳江市', '阳江', '', 5, 0),
(515, '湛江市', '湛江', '', 5, 0),
(516, '茂名市', '茂名', '', 5, 0),
(517, '肇庆市', '肇庆', '', 5, 0),
(518, '清远市', '清远', '', 5, 0),
(519, '潮州市', '潮州', '', 5, 0),
(520, '揭阳市', '揭阳', '', 5, 0),
(521, '云浮市', '云浮', '', 5, 0),
(601, '福州市', '福州', '', 6, 0),
(602, '厦门市', '厦门', '', 6, 0),
(603, '三明市', '三明', '', 6, 0),
(604, '莆田市', '莆田', '', 6, 0),
(605, '泉州市', '泉州', '', 6, 0),
(606, '漳州市', '漳州', '', 6, 0),
(607, '南平市', '南平', '', 6, 0),
(608, '龙岩市', '龙岩', '', 6, 0),
(609, '宁德市', '宁德', '', 6, 0),
(701, '杭州市', '杭州', '', 7, 0),
(702, '宁波市', '宁波', '', 7, 0),
(703, '温州市', '温州', '', 7, 0),
(704, '嘉兴市', '嘉兴', '', 7, 0),
(705, '湖州市', '湖州', '', 7, 0),
(706, '绍兴市', '绍兴', '', 7, 0),
(707, '金华市', '金华', '', 7, 0),
(708, '衢州市', '衢州', '', 7, 0),
(709, '舟山市', '舟山', '', 7, 0),
(710, '台州市', '台州', '', 7, 0),
(711, '丽水市', '丽水', '', 7, 0),
(801, '南京市', '南京', '', 8, 0),
(802, '徐州市', '徐州', '', 8, 0),
(803, '连云港市', '连云港', '', 8, 0),
(804, '淮安市', '淮安', '', 8, 0),
(805, '宿迁市', '宿迁', '', 8, 0),
(806, '盐城市', '盐城', '', 8, 0),
(807, '扬州市', '扬州', '', 8, 0),
(808, '泰州市', '泰州', '', 8, 0),
(809, '南通市', '南通', '', 8, 0),
(810, '镇江市', '镇江', '', 8, 0),
(811, '常州市', '常州', '', 8, 0),
(812, '无锡市', '无锡', '', 8, 0),
(813, '苏州市', '苏州', '', 8, 0),
(901, '济南市', '济南', '', 9, 0),
(902, '青岛市', '青岛', '', 9, 0),
(903, '淄博市', '淄博', '', 9, 0),
(904, '枣庄市', '枣庄', '', 9, 0),
(905, '东营市', '东营', '', 9, 0),
(906, '潍坊市', '潍坊', '', 9, 0),
(907, '烟台市', '烟台', '', 9, 0),
(908, '威海市', '威海', '', 9, 0),
(909, '济宁市', '济宁', '', 9, 0),
(910, '泰安市', '泰安', '', 9, 0),
(911, '日照市', '日照', '', 9, 0),
(912, '莱芜市', '莱芜', '', 9, 0),
(913, '德州市', '德州', '', 9, 0),
(914, '临沂市', '临沂', '', 9, 0),
(915, '聊城市', '聊城', '', 9, 0),
(916, '滨州市', '滨州', '', 9, 0),
(917, '菏泽市', '菏泽', '', 9, 0),
(1001, '沈阳市', '沈阳', '', 10, 0),
(1002, '大连市', '大连', '', 10, 0),
(1003, '鞍山市', '鞍山', '', 10, 0),
(1004, '抚顺市', '抚顺', '', 10, 0),
(1005, '本溪市', '本溪', '', 10, 0),
(1006, '丹东市', '丹东', '', 10, 0),
(1007, '锦州市', '锦州', '', 10, 0),
(1008, '葫芦岛市', '葫芦岛', '', 10, 0),
(1009, '营口市', '营口', '', 10, 0),
(1010, '盘锦市', '盘锦', '', 10, 0),
(1011, '阜新市', '阜新', '', 10, 0),
(1012, '辽阳市', '辽阳', '', 10, 0),
(1013, '铁岭市', '铁岭', '', 10, 0),
(1014, '朝阳市', '朝阳', '', 10, 0),
(1101, '南昌市', '南昌', '', 11, 0),
(1102, '景德镇市', '景德镇', '', 11, 0),
(1103, '萍乡市', '萍乡', '', 11, 0),
(1104, '新余市', '新余', '', 11, 0),
(1105, '九江市', '九江', '', 11, 0),
(1106, '鹰潭市', '鹰潭', '', 11, 0),
(1107, '赣州市', '赣州', '', 11, 0),
(1108, '吉安市', '吉安', '', 11, 0),
(1109, '宜春市', '宜春', '', 11, 0),
(1110, '抚州市', '抚州', '', 11, 0),
(1111, '上饶市', '上饶', '', 11, 0),
(1201, '成都市', '成都', '', 12, 0),
(1202, '自贡市', '自贡', '', 12, 0),
(1203, '攀枝花市', '攀枝花', '', 12, 0),
(1204, '泸州市', '泸州', '', 12, 0),
(1205, '德阳市', '德阳', '', 12, 0),
(1206, '绵阳市', '绵阳', '', 12, 0),
(1207, '广元市', '广元', '', 12, 0),
(1208, '遂宁市', '遂宁', '', 12, 0),
(1209, '内江市', '内江', '', 12, 0),
(1210, '乐山市', '乐山', '', 12, 0),
(1211, '南充市', '南充', '', 12, 0),
(1212, '宜宾市', '宜宾', '', 12, 0),
(1213, '广安市', '广安', '', 12, 0),
(1214, '达州市', '达州', '', 12, 0),
(1215, '巴中市', '巴中', '', 12, 0),
(1216, '雅安市', '雅安', '', 12, 0),
(1217, '眉山市', '眉山', '', 12, 0),
(1218, '资阳市', '资阳', '', 12, 0),
(1219, '阿坝州', '阿坝', '', 12, 0),
(1220, '甘孜州', '甘孜', '', 12, 0),
(1221, '凉山州', '凉山', '', 12, 0),
(3114, '西安市', '西安', '', 13, 0),
(1302, '铜川市', '铜川', '', 13, 0),
(1303, '宝鸡市', '宝鸡', '', 13, 0),
(1304, '咸阳市', '咸阳', '', 13, 0),
(1305, '渭南市', '渭南', '', 13, 0),
(1306, '延安市', '延安', '', 13, 0),
(1307, '汉中市', '汉中', '', 13, 0),
(1308, '榆林市', '榆林', '', 13, 0),
(1309, '安康市', '安康', '', 13, 0),
(1310, '商洛地区', '商洛地区', '', 13, 0),
(1401, '武汉市', '武汉', '', 14, 0),
(1402, '黄石市', '黄石', '', 14, 0),
(1403, '襄樊市', '襄樊', '', 14, 0),
(1404, '十堰市', '十堰', '', 14, 0),
(1405, '荆州市', '荆州', '', 14, 0),
(1406, '宜昌市', '宜昌', '', 14, 0),
(1407, '荆门市', '荆门', '', 14, 0),
(1408, '鄂州市', '鄂州', '', 14, 0),
(1409, '孝感市', '孝感', '', 14, 0),
(1410, '黄冈市', '黄冈', '', 14, 0),
(1411, '咸宁市', '咸宁', '', 14, 0),
(1412, '随州市', '随州', '', 14, 0),
(1413, '仙桃市', '仙桃', '', 14, 0),
(1414, '天门市', '天门', '', 14, 0),
(1415, '潜江市', '潜江', '', 14, 0),
(1416, '神农架', '神农架', '', 14, 0),
(1417, '恩施州', '恩施', '', 14, 0),
(1501, '郑州市', '郑州', '', 15, 0),
(1502, '开封市', '开封', '', 15, 0),
(1503, '洛阳市', '洛阳', '', 15, 0),
(1504, '平顶山市', '平顶山', '', 15, 0),
(1505, '焦作市', '焦作', '', 15, 0),
(1506, '鹤壁市', '鹤壁', '', 15, 0),
(1507, '新乡市', '新乡', '', 15, 0),
(1508, '安阳市', '安阳', '', 15, 0),
(1509, '濮阳市', '濮阳', '', 15, 0),
(1510, '许昌市', '许昌', '', 15, 0),
(1511, '漯河市', '漯河', '', 15, 0),
(1512, '三门峡市', '三门峡', '', 15, 0),
(1513, '南阳市', '南阳', '', 15, 0),
(1514, '商丘市', '商丘', '', 15, 0),
(1515, '信阳市', '信阳', '', 15, 0),
(1516, '周口市', '周口', '', 15, 0),
(1517, '驻马店市', '驻马店', '', 15, 0),
(1518, '济源市', '济源', '', 15, 0),
(1601, '石家庄市', '石家庄', '', 16, 0),
(1602, '唐山市', '唐山', '', 16, 0),
(1603, '秦皇岛市', '秦皇岛', '', 16, 0),
(1604, '邯郸市', '邯郸', '', 16, 0),
(1605, '邢台市', '邢台', '', 16, 0),
(1606, '保定市', '保定', '', 16, 0),
(1607, '张家口市', '张家口', '', 16, 0),
(1608, '承德市', '承德', '', 16, 0),
(1609, '沧州市', '沧州', '', 16, 0),
(1610, '廊坊市', '廊坊', '', 16, 0),
(1611, '衡水市', '衡水', '', 16, 0),
(1701, '太原市', '太原', '', 17, 0),
(1702, '大同市', '大同', '', 17, 0),
(1703, '阳泉市', '阳泉', '', 17, 0),
(1704, '长治市', '长治', '', 17, 0),
(1705, '晋城市', '晋城', '', 17, 0),
(1706, '朔州市', '朔州', '', 17, 0),
(1707, '晋中市', '晋中', '', 17, 0),
(1708, '忻州市', '忻州', '', 17, 0),
(1709, '临汾市', '临汾', '', 17, 0),
(1710, '运城市', '运城', '', 17, 0),
(1711, '吕梁地区', '吕梁地区', '', 17, 0),
(1801, '呼和浩特', '呼和浩特', '', 18, 0),
(1802, '包头市', '包头', '', 18, 0),
(1803, '乌海市', '乌海', '', 18, 0),
(1804, '赤峰市', '赤峰', '', 18, 0),
(1805, '通辽市', '通辽', '', 18, 0),
(1806, '鄂尔多斯', '鄂尔多斯', '', 18, 0),
(1807, '乌兰察布', '乌兰察布', '', 18, 0),
(1808, '锡林郭勒', '锡林郭勒', '', 18, 0),
(1809, '呼伦贝尔', '呼伦贝尔', '', 18, 0),
(1810, '巴彦淖尔', '巴彦淖尔', '', 18, 0),
(1811, '阿拉善盟', '阿拉善盟', '', 18, 0),
(1812, '兴安盟', '兴安盟', '', 18, 0),
(1901, '长春市', '长春', '', 19, 0),
(1902, '吉林市', '吉林', '', 19, 0),
(1903, '四平市', '四平', '', 19, 0),
(1904, '辽源市', '辽源', '', 19, 0),
(1905, '通化市', '通化', '', 19, 0),
(1906, '白山市', '白山', '', 19, 0),
(1907, '松原市', '松原', '', 19, 0),
(1908, '白城市', '白城', '', 19, 0),
(1909, '延边州', '延边', '', 19, 0),
(2001, '哈尔滨市', '哈尔滨', '', 20, 0),
(2002, '齐齐哈尔', '齐齐哈尔', '', 20, 0),
(2003, '鹤岗市', '鹤岗', '', 20, 0),
(2004, '双鸭山市', '双鸭山', '', 20, 0),
(2005, '鸡西市', '鸡西', '', 20, 0),
(2006, '大庆市', '大庆', '', 20, 0),
(2007, '伊春市', '伊春', '', 20, 0),
(2008, '牡丹江市', '牡丹江', '', 20, 0),
(2009, '佳木斯市', '佳木斯', '', 20, 0),
(2010, '七台河市', '七台河', '', 20, 0),
(2011, '黑河市', '黑河', '', 20, 0),
(2012, '绥化市', '绥化', '', 20, 0),
(2013, '大兴安岭', '大兴安岭', '', 20, 0),
(2101, '合肥市', '合肥', '', 21, 0),
(2102, '芜湖市', '芜湖', '', 21, 0),
(2103, '蚌埠市', '蚌埠', '', 21, 0),
(2104, '淮南市', '淮南', '', 21, 0),
(2105, '马鞍山市', '马鞍山', '', 21, 0),
(2106, '淮北市', '淮北', '', 21, 0),
(2107, '铜陵市', '铜陵', '', 21, 0),
(2108, '安庆市', '安庆', '', 21, 0),
(2109, '黄山市', '黄山', '', 21, 0),
(2110, '滁州市', '滁州', '', 21, 0),
(2111, '阜阳市', '阜阳', '', 21, 0),
(2112, '宿州市', '宿州', '', 21, 0),
(2113, '巢湖市', '巢湖', '', 21, 0),
(2114, '六安市', '六安', '', 21, 0),
(2115, '亳州市', '亳州', '', 21, 0),
(2116, '宣城市', '宣城', '', 21, 0),
(2117, '池州市', '池州', '', 21, 0),
(2201, '长沙市', '长沙', '', 22, 0),
(2202, '株州市', '株州', '', 22, 0),
(2203, '湘潭市', '湘潭', '', 22, 0),
(2204, '衡阳市', '衡阳', '', 22, 0),
(2205, '邵阳市', '邵阳', '', 22, 0),
(2206, '岳阳市', '岳阳', '', 22, 0),
(2207, '常德市', '常德', '', 22, 0),
(2208, '张家界市', '张家界', '', 22, 0),
(2209, '益阳市', '益阳', '', 22, 0),
(2210, '郴州市', '郴州', '', 22, 0),
(2211, '永州市', '永州', '', 22, 0),
(2212, '怀化市', '怀化', '', 22, 0),
(2213, '娄底市', '娄底', '', 22, 0),
(2214, '湘西州', '湘西', '', 22, 0),
(2301, '南宁市', '南宁', '', 23, 0),
(2302, '柳州市', '柳州', '', 23, 0),
(2303, '桂林市', '桂林', '', 23, 0),
(2304, '梧州市', '梧州', '', 23, 0),
(2305, '北海市', '北海', '', 23, 0),
(2306, '防城港市', '防城港', '', 23, 0),
(2307, '钦州市', '钦州', '', 23, 0),
(2308, '贵港市', '贵港', '', 23, 0),
(2309, '玉林市', '玉林', '', 23, 0),
(2310, '南宁地区', '南宁地区', '', 23, 0),
(2311, '柳州地区', '柳地区', '', 23, 0),
(2312, '贺州地区', '贺地区', '', 23, 0),
(2313, '百色地区', '百色地区', '', 23, 0),
(2314, '河池地区', '河池地区', '', 23, 0),
(2401, '海口市', '海口', '', 24, 0),
(2402, '三亚市', '三亚', '', 24, 0),
(2403, '五指山市', '五指山', '', 24, 0),
(2404, '琼海市', '琼海', '', 24, 0),
(2405, '儋州市', '儋州', '', 24, 0),
(2406, '琼山市', '琼山', '', 24, 0),
(2407, '文昌市', '文昌', '', 24, 0),
(2408, '万宁市', '万宁', '', 24, 0),
(2409, '东方市', '东方', '', 24, 0),
(2410, '澄迈县', '澄迈县', '', 24, 0),
(2411, '定安县', '定安县', '', 24, 0),
(2412, '屯昌县', '屯昌县', '', 24, 0),
(2413, '临高县', '临高县', '', 24, 0),
(2414, '白沙县', '白沙县', '', 24, 0),
(2415, '昌江县', '昌江县', '', 24, 0),
(2416, '乐东县', '乐东县', '', 24, 0),
(2417, '陵水县', '陵水县', '', 24, 0),
(2418, '保亭县', '保亭县', '', 24, 0),
(2419, '琼中县', '琼中县', '', 24, 0),
(2501, '昆明市', '昆明', '', 25, 0),
(2502, '曲靖市', '曲靖', '', 25, 0),
(2503, '玉溪市', '玉溪', '', 25, 0),
(2504, '保山市', '保山', '', 25, 0),
(2505, '昭通市', '昭通', '', 25, 0),
(2506, ' 普洱市', ' 普洱', '', 25, 0),
(2507, '临沧市', '临沧', '', 25, 0),
(2508, '丽江市', '丽江', '', 25, 0),
(2509, '文山州', '文山', '', 25, 0),
(2510, '红河州', '红河', '', 25, 0),
(2511, '西双版纳', '西双版纳', '', 25, 0),
(2512, '楚雄州', '楚雄', '', 25, 0),
(2513, '大理州', '大理', '', 25, 0),
(2514, '德宏州', '德宏', '', 25, 0),
(2515, '怒江州', '怒江', '', 25, 0),
(2516, '迪庆州', '迪庆', '', 25, 0),
(2601, '贵阳市', '贵阳', '', 26, 0),
(2602, '六盘水市', '六盘水', '', 26, 0),
(2603, '遵义市', '遵义', '', 26, 0),
(2604, '安顺市', '安顺', '', 26, 0),
(2605, '铜仁地区', '铜仁地区', '', 26, 0),
(2606, '毕节地区', '毕节地区', '', 26, 0),
(2607, '黔西南州', '黔西南', '', 26, 0),
(2608, '黔东南州', '黔东南', '', 26, 0),
(2609, '黔南州', '黔南', '', 26, 0),
(2701, '拉萨市', '拉萨', '', 27, 0),
(2702, '那曲地区', '那曲地区', '', 27, 0),
(2703, '昌都地区', '昌都地区', '', 27, 0),
(2704, '山南地区', '山南地区', '', 27, 0),
(2705, '日喀则', '日喀则', '', 27, 0),
(2706, '阿里地区', '阿里地区', '', 27, 0),
(2707, '林芝地区', '林芝地区', '', 27, 0),
(2801, '兰州市', '兰州', '', 28, 0),
(2802, '金昌市', '金昌', '', 28, 0),
(2803, '白银市', '白银', '', 28, 0),
(2804, '天水市', '天水', '', 28, 0),
(2805, '嘉峪关市', '嘉峪关', '', 28, 0),
(2806, '武威市', '武威', '', 28, 0),
(2807, '定西地区', '定西地区', '', 28, 0),
(2808, '平凉地区', '平凉地区', '', 28, 0),
(2809, '庆阳地区', '庆阳地区', '', 28, 0),
(2810, '陇南地区', '陇南地区', '', 28, 0),
(2811, '张掖地区', '张掖地区', '', 28, 0),
(2812, '酒泉地区', '酒泉地区', '', 28, 0),
(2813, '甘南州', '甘南', '', 28, 0),
(2814, '临夏州', '临夏', '', 28, 0),
(2901, '银川市', '银川', '', 29, 0),
(2902, '石嘴山市', '石嘴山', '', 29, 0),
(2903, '吴忠市', '吴忠', '', 29, 0),
(2904, '固原市', '固原', '', 29, 0),
(3001, '西宁市', '西宁', '', 30, 0),
(3002, '海东地区', '海东地区', '', 30, 0),
(3003, '海北州', '海北', '', 30, 0),
(3004, '黄南州', '黄南', '', 30, 0),
(3005, '海南州', '海南', '', 30, 0),
(3006, '果洛州', '果洛', '', 30, 0),
(3007, '玉树州', '玉树', '', 30, 0),
(3008, '海西州', '海西', '', 30, 0),
(3101, '乌鲁木齐', '乌鲁木齐', '', 31, 0),
(3102, '克拉玛依', '克拉玛依', '', 31, 0),
(3103, '石河子市', '石河子', '', 31, 0),
(3104, '吐鲁番', '吐鲁番', '', 31, 0),
(3105, '哈密地区', '哈密地区', '', 31, 0),
(3106, '和田地区', '和田地区', '', 31, 0),
(3107, '阿克苏', '阿克苏', '', 31, 0),
(3108, '喀什地区', '喀什地区', '', 31, 0),
(3109, '克孜勒苏', '克孜勒苏', '', 31, 0),
(3110, '巴音郭楞', '巴音郭楞', '', 31, 0),
(3111, '昌吉州', '昌吉', '', 31, 0),
(3112, '博尔塔拉', '博尔塔拉', '', 31, 0),
(3113, '伊犁州', '伊犁', '', 31, 0),
(3201, '香港岛', '香港岛', '', 32, 0),
(3202, '九龙', '九龙', '', 32, 0),
(3203, '新界', '新界', '', 32, 0),
(3301, '澳门半岛', '澳门半岛', '', 33, 0),
(3302, '离岛', '离岛', '', 33, 0),
(3401, '台北市', '台北', '', 34, 0),
(3402, '高雄市', '高雄', '', 34, 0),
(3403, '台南市', '台南', '', 34, 0),
(3404, '台中市', '台中', '', 34, 0),
(3405, '金门县', '金门县', '', 34, 0),
(3406, '南投县', '南投县', '', 34, 0),
(3407, '基隆市', '基隆', '', 34, 0),
(3408, '新竹市', '新竹', '', 34, 0),
(3409, '嘉义市', '嘉义', '', 34, 0),
(3410, '新北市', '新北', '', 34, 0),
(3411, '宜兰县', '宜兰县', '', 34, 0),
(3412, '新竹县', '新竹县', '', 34, 0),
(3413, '桃园县', '桃园县', '', 34, 0),
(3414, '苗栗县', '苗栗县', '', 34, 0),
(3415, '彰化县', '彰化县', '', 34, 0),
(3416, '嘉义县', '嘉义县', '', 34, 0),
(3417, '云林县', '云林县', '', 34, 0),
(3418, '屏东县', '屏东县', '', 34, 0),
(3419, '台东县', '台东县', '', 34, 0),
(3420, '花莲县', '花莲县', '', 34, 0),
(3421, '澎湖县', '澎湖县', '', 34, 0),
(6001, '美国', '美国', '', 60, 0),
(6002, '英国', '英国', '', 60, 0),
(6003, '法国', '法国', '', 60, 0),
(6004, '俄罗斯', '俄罗斯', '', 60, 0),
(6005, '加拿大', '加拿大', '', 60, 0),
(6006, '巴西', '巴西', '', 60, 0),
(6007, '澳大利亚', '澳大利亚', '', 60, 0),
(6008, '印尼', '印尼', '', 60, 0),
(6009, '马来西亚', '马来西亚', '', 60, 0),
(6010, '新加坡', '新加坡', '', 60, 0),
(6011, '菲律宾', '菲律宾', '', 60, 0),
(6012, '越南', '越南', '', 60, 0),
(6013, '印度', '印度', '', 60, 0),
(6014, '日本', '日本', '', 60, 0),
(6015, '韩国', '韩国', '', 60, 0),
(6016, '泰国', '泰国', '', 60, 0),
(6017, '缅甸', '缅甸', '', 60, 0),
(6018, '其他', '其他', '', 60, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_article`
--

DROP TABLE IF EXISTS `yy_article`;
CREATE TABLE `yy_article` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL DEFAULT '' COMMENT '标题',
  `short_title` varchar(100) NOT NULL DEFAULT '' COMMENT '副标题',
  `color` char(10) NOT NULL DEFAULT '' COMMENT '标题颜色',
  `copyfrom` varchar(30) NOT NULL DEFAULT '',
  `author` varchar(30) NOT NULL DEFAULT '',
  `keywords` varchar(50) DEFAULT '' COMMENT '关键字',
  `litpic` varchar(150) NOT NULL DEFAULT '' COMMENT '缩略图',
  `content` text COMMENT '内容',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '摘要描述',
  `publish_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `update_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `click` smallint(6) UNSIGNED NOT NULL DEFAULT '0' COMMENT '点击数',
  `cid` int(10) UNSIGNED NOT NULL COMMENT '分类ID',
  `point` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '权重[越大越前]',
  `comment_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '允许评论',
  `flag` tinyint(3) UNSIGNED NOT NULL DEFAULT '0' COMMENT '属性',
  `jump_url` varchar(200) NOT NULL DEFAULT '',
  `delete_status` int(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '1回收站',
  `audit_status` int(10) UNSIGNED NOT NULL DEFAULT '1' COMMENT '审核状态[0未审核,1通过]',
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'admin'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_article`
--

INSERT INTO `yy_article` (`id`, `title`, `short_title`, `color`, `copyfrom`, `author`, `keywords`, `litpic`, `content`, `description`, `publish_time`, `update_time`, `click`, `cid`, `point`, `comment_flag`, `flag`, `jump_url`, `delete_status`, `audit_status`, `user_id`, `aid`) VALUES
(4, '对于电商而言，比特币的未来会是什么样?', '', '', '', '', '比特币,支付平台', '', '<p>　　随着比特币价值的急剧上涨，引起了普通大众对这个数字货币的注意，在2013年，比特币的价值就从13美元上涨到了1000美元。我们可以看到，许多主流经济学家在讨论这个数字货币，全球多个国家也在质疑比特币的合法性，不仅如此，一些知名的对冲基金也在他们的投资组合中购买了比特币，这些行为，多少让人感觉比特币存在一定的投机性。去年，对比特币来说，绝对算的上是最热闹的一年。</p><p>　　不过，对于企业和电子商务网站而言，现在是否是一个合适的时间开始接受比特币，并把它作为一种支付手段呢?</p><p>　　“在零售行业里，我们已经看到有些企业对比特币充满了好感。一些零售商相信，他们只是商人，只要能把商品销售出去，他们并不排斥任何形式的支付交易形式，” Mahesh Gandhe说道,他是Rackspace Digital公司的产品营销经理， “然而另外一方面，一些人对比特币则持怀疑态度，他们认为，在正式接纳、采用比特币之前，联邦政府应该对它进行规范化。”</p><p>　　在线零售商在决定是否采用比特币作为支付方式的时候，可以考虑一下本文提到的一些要点：</p><p>　　花掉从庄家那里赢来的钱</p><p>　　那些早期拥有比特币的投资人是非常幸运的，因为他们可以看到这些数字货币忽然一下子成为了一种真实的有形资产。当比特币的价值从几分钱陡增到几百美元，许多早期比特币持有者一下子获得了一大笔意外之财。</p><p>　　本质上来说，这种感觉就像是忽然捡到了一大笔钱，也像是一个在拉斯维加斯的赌徒，在连续赢钱的时候，就会大把大把的花掉口袋里从庄家那里赢来的钱。</p><p>　　实际上，许多早期的比特币持有者很容易被情绪所支配，虽然获得了一大笔意外之财，但是他们并不满足，最近，他们希望比特币可以变成一个主流货币。这对于那些在电子商务网站上使用比特币处理支付的早期用户来说，也许意味着是一种福利。</p><p>　　这里有一个不错的例子，那就是电商网站Overstock.com，他们最近接受了比特币。就在他们正式接受比特币作为支付手段不到一天的时间，该公司首席执行官Patrick Byrne就在推特上发布了一条推文，上面写道，他们公司已经收到了超过780份使用比特币支付的订单，总销售额超过12.4万美元。对于商户而言，他们只不过是提供了一个渠道，让那些充满激情的比特币用户能够花掉自己新获得的财富，显然，在这场刚刚开始的比特币盛宴中，那些走在前面的电子商务公司会得到一定的利益。</p><p>　　免费宣传</p><p>　　现在，那些接受比特币这种数字货币的零售商数量还比较少，也就是说，比特币在电商网站上应用支付还处于初级阶段，因此，如果你的电商网站接受了比特币支付，那么就会引起媒体大批量的报道。Roger Wu是Cooperatize.com的联合创始人，目前这个网站也开始接受比特币支付了。在最近一篇《福布斯》杂志的文章中，他提到，“接受比特币支付既是一件新鲜的事务，也存在一定风险，但是它也会带给你一定的曝光率，就像是经营最初的公共关系一样。”</p><p>　　在线约会网站OKCupid也是第一批接受比特币支付的大公司之一，他们是在2013年四月份开始接受比特币的。实际上，OKCupid使用比特币作为支付所带来的销售额并不是太大，大约只有一千人用比特币在其网站上进行支付，但是该公司却得到了大量的免费宣传，互联网上有许多文章都在介绍他们，因为他们是第一家接受比特币支付的约会网站。</p><p>　　当然啦，当越来越多的企业开始接受比特币，那么相应的新闻报道数量也会随之减少，但是就最近而言，如果你的公司接受比特币支付，那么仍然有很大机会获得一些媒体曝光。</p><p>　　比特币价值的不稳定性</p><p>　　比特币目前的价值是非常不稳定的，那些接受比特币支付的企业现在还不能实时地把这个数字货币兑换成本国货币，因此在这中间就存在了一定风险，因为有可能，比特币的价值会挥发掉，当然它也存在升值的可能性。</p><p>　　不仅如此，比特币还存在一种失控的可能性，在电子商务开源解决方案平台PrestaShop上，Gary Le Masson描述了一种具体情况，并将这种可能性赋予了一个名词，比特币失控(Bitcoin Crack)。基本上，这个名词的含义就是说，比特币价格会出现一种急剧下跌的情况，有可能在一天时间内下跌百倍，但是比特币也可能随后出现实物“买涨”的情况，价值又出现上浮，总而言之，比特币价值不够稳定，难以控制。</p><p>　　比特币持有人并不会用他们贬值的比特币去兑换美元，取而代之的是，他们会赶紧登上你的电子商务网站，用这个数字货币去购买一些有形商品。如果你的网站无法实时更新关联的比特币价格，那么作为一家电子商务公司，结果就很可能是下面这种情况：你收到了洪水般的购买订单，但是在结账的时候，你会发现，自己收到的却是已经贬值的货币。</p><p>　　货币安全</p><p>　　如今，几乎所有的东西都数字化了，因此，比特币的持有人必须要为他们的数字资产采取一定的预防措施。对于比特币钱包而言，现在已经部署了许多安全防范措施，其中最好的做法之一，就是把绝大部分资金存放在离线，加密的钱包之中。</p><p>　　正如Bitcoin.org网站给出的建议，他们认为，“比特币钱包就像是一个装满现金的钱包，举个例子，你肯定不会在自己的钱包里面装上一千美元，因为这笔现金太多了，也很危险，事实上，比特币钱包也一样，你也应该有同样的考虑。”</p><p>　　如果你使用比特币离线存储策略，那么当务之急就是要赶紧备份好自己的钱包，最好可能进行多个备份。举个例子，如果你的硬盘驱动器坏了，那么里面存储的数字照片可能会丢失，比特币钱包也一样，如果发生硬件故障，那么你的钱包也可能丢失。备份多个离线数字钱包是非常关键的，因为这么做可以有效的保护你的数字资产。</p><p>　　减轻波动性，增强安全性</p><p>　　许多在线零售商户都非常担心比特币的波动性和安全性，为了帮助他们消除相关方面的顾虑，笔者在此提供一些工具和平台，也许会对电商公司有所帮助。举个例子，Coinbase就是这样一个平台，它可以帮助商户便捷地接受比特币作为支付手段。另外，为了不受比特币价格波动的影响，电商商户可以特别指明自己所提供的商品或服务所对应的本国货币价格。</p><p>　　在日终结算的时候，Coinbase可以帮助商户将所有比特币交易的商品和销售额进行汇总，然后算出一个总销售额，并把这笔钱打入到商户的账户里面，Coinbase会收取一定的手续费，但是这笔手续费不会超过总交易金额的1%。</p><p>　　“举个例子，商户可以给一台烤面包机定价为30美元，在后台，这个金额会兑换成对应数量的比特币，然后用户就可以用比特币进行支付，Coinbase会把用户支付的比特币实时转换成美元，”Fred Ehrsam在SXSW大会上说道，他是Coinbase公司的联合创始人，“对于商户来说，不存在汇率风险，整个支付过程看上去只是给商户多了一个支付选择，而且速度更快，费用也更低。”</p><p>　　不仅如此，由于可以把商户每天的比特币销售额转换成本国货币，在线零售商也不用担心比特币的安全性问题了，也不用担心自己的比特币钱包内的资金太多。</p><p>　　不过，电子商务公司在选择第三方支付平台的时候，必须要做到非常谨慎。今年二月底，全球最大的比特币交易所Mt.Gox倒闭了，他们估算约有744，408个比特币单元下落不明。由于比特币不受监管的特性，导致比特币变成了一把双刃剑，如果你的电商公司决定使用比特币，那么比较要非常谨慎的去评估每一个比特币交易所和比特币平台，这点非常重要。</p><p>　　未来货币或金融架构?</p><p>　　虽然目前比特币还不能被看作是一个真正意义上的货币，但是它的使用范围正在变得越来越广泛，势头也很强劲。随着这种势头，比特币的未来似乎要朝着两条路发展。一条路是它有机会变成一种主流货币，人们可以实际购买，出售，并持有比特币，无需折腾来折腾去，不断地把比特币兑换成本国货币使用。</p><p>　　第二条路，就是比特币会变成一种协议，专门为在线货币兑换服务，这样的话，像Coinbase这样的比特币交易平台就会在买家和卖家之间提供兑换服务，就当下普遍情况来看，比特币交易平台收取的手续费率一般不会超过2.5%。如今，不管商户是否接受比特币，对于电子商务公司和在线商户而言，这场趋势所带来的变革绝对是非常有趣的。</p><p>　　（via tnw 译/快鲤鱼）</p><p><br/></p>', '随着比特币价值的急剧上涨，引起了普通大众对这个数字货币的注意，在2013年，比特币的价值就从13美元上涨到了1000美元。', '2014-03-31 14:02:27', '2017-11-11 09:38:04', 77, 3, 100, 1, 0, '', 0, 1, 0, 1),
(5, 'Facebook披露Connectivity Labs，推进无人机计划', '', '', '', '', '无人机,支付平台', '', '<p>　　【Facebook披露Connectivity Labs，推进无人机计划】前不久，Facebook刚刚收购了无人机制造商Titan Aerospace，他们计划用无人机技术把互联网带到世界上任何一个角落，让没有网络的地方也能连上网。今日，Mark Zuckerberg 宣布已经为其“连接实验室(Connectivity Lab)”项目找来了来自美国宇航局的喷气推进实验室和艾姆斯研究中心的航空和通信专家们。</p><p>　　据资料显示，这种无人机能够利用太阳能在高纬度航行数月。Facebook此前联合爱立信、诺基亚、高通、三星等企业推出了Internet.org计划，与电信运营商进行合作，让人们连接互联网变得更容易。谷歌也在试图“连接世界”。该公司计划利用太阳能热气球向偏远地区人们提供互联网接入服务。</p><p>　　【微软正式发布iPad 版Office应用套件】在新CEO Satya Nadella 上任后，微软正在进行改革。微软一改此前态度，推出iPad版Office套件。微软周四宣布，iPad用户即日起可通过苹果公司的应用商店下载或购买其包含Word、Excel和PowerPoint在内的Office应用套件。iPad版Office还支持触摸屏控制，用户们可以通过拖拽操作。</p><p>　　【苹果新专利：蓝宝石玻璃防油污涂层】本周四披露的专利显示，苹果获得了“蓝宝石玻璃防油污涂层”专利。这种技术可以应用在手机、平板电脑和其他便携式设备上。此举或说明苹果正在积极研发蓝宝石玻璃相关的技术，iPhone6有望配备蓝宝石显示屏。 今日有媒体称苹果公司或将在9月发布“iPhone 6”，提供4.7英寸和5.5英寸两种显示屏尺寸。</p><p>　　【流媒体音乐服务商Spotify有望今年秋季IPO】流媒体音乐服务商Spotify已经开始接触投行，并且有可能会在今年秋季IPO。Spotify由两位瑞典企业家创建于2008年，现在已经成了成长最快的音乐流媒体服务之一。对于华尔街而言，Spotify或许会很受欢迎：因为它有85%的收入来自订阅费用而不是广告。其最大竞争对手Pandora在2011年就上市了。</p><p>　　【英特尔入股大数据初创企业Cloudera】英特尔周四表示，公司投资大数据软件初创公司Cloudera，并已成为该公司最大的战略股东。英特尔希望通过此投资来扩大其服务器业务，以抵消个人电脑市场下滑所带来的冲击。</p><p>　　英特尔指出，入股Cloudera是其在数据中心领域所完成的最大规模的一次投资。但该公司未公布具体的交易金额。</p><p>　　Cloudera是一家专注于帮助企业客户利用Hadoop管理大数据的初创公司。英特尔将推广Cloudera的Hadoop解决方案。</p><p><br/></p>', 'Facebook刚刚收购了无人机制造商Titan Aerospace，他们计划用无人机技术把互联网带到世界上任何一个角落', '2014-03-31 14:03:43', '2017-10-17 16:35:22', 80, 3, 100, 1, 0, '', 0, 1, 0, 1),
(6, '外卖送餐服务Sprig获A轮融资1000万美金，现做热乎饭菜20分钟内送上门', '', '', '', '', '', '', '<p>　　外卖送餐服务Sprig刚刚获得 A 轮融资 1000 万美金，领投方为 Greylock Partners，Accel Partners 和 Battery Ventures 参投。此前获得天使轮 200 万美金。</p><p>　　Sprig 在食材上选择当地应季的健康原材料，算是它跟其它服务的一个差异；每天用户可选套餐为 3 种，每日更换菜谱，20 分钟内将热乎乎的现做饭菜送上门，通过应用内预订和支付完成交易。每个套菜订价 10 美元，外加 2 美元快递费。有需要的话，用户也提出择无麸质和素食这样的条件。服务时间段为 5:30pm-9:30pm，看来服务人群像是没人给做饭吃的单身上班族。</p><p>　　如此看来 Sprig 的服务及时、健康、价格合理。个人认为，做好 O2O 服务的关键就是要把整个流程标准化，从菜品策划、烹饪、送餐等环节概莫能外。</p><p>　　此外，为 Sprig 增光的另一个事实在于它的主厨曾是负责 Google 当年的大厨 Nate Keller。</p><p>　　Sprig 目前仅服务于旧金山的各个社区，不知拿到这笔融资会不会把这个服务复制到其它城市。送餐服务是个竞争很激烈的市场，Square 也在旧金山小范围测试午餐服务Pickup， 仅限订餐、送达服务。</p><p>　　该公司联合创始人为 Gagan Biyani，是开放式在线教育 Udemy的创始团队的一员，也曾是私家家共享服务 Lyft 向洛山矶扩张时的顾问。</p><p>　　[36氪，作者: Chloe]</p><p><br/></p>', '外卖送餐服务Sprig刚刚获得 A 轮融资 1000 万美金，领投方为 Greylock Partners，Accel Partners 和 Battery Ventures 参投。此前获得天使轮 200 万美金。', '2014-03-31 14:05:43', '2017-10-16 21:33:08', 39, 4, 100, 1, 0, '', 0, 1, 0, 1),
(7, '智能汽车战场硝烟弥漫 苹果谷歌双雄对决', '', '', '', '', '', '', '<p>　　在不久前召开的“日内瓦车展”（Geneva Motor Show）上，苹果正式发布了备受期待的CarPlay车载智能系统，而包括梅赛德斯奔驰、法拉利、宝马、福特、通用、本田、现代、捷豹、路虎、起亚、三菱、日产、标致雪铁龙、斯巴鲁、铃木以及丰田等知名汽车厂商也都同苹果达成了合作伙伴关系，因此我们有望在不久后问世的新车型中看到这一系统的出现。</p><p>　　在看到这里的时候我们不禁要问，苹果的CarPlay究竟有什么过人之处？</p><p>　　从表面来看，这一产品仅仅是针对汽车厂商推出了一个经过深度定制的车载操作界面而已，这同微软和福特在2007年CES展会上所推出的车载娱乐系统“Ford Sync”非常类似，该系统同样可让驾驶者通过语音指令拨打电话、听取文字信息。驾驶者也可以利用语音指令或方向盘上的按钮播放iPod、Zune等便携设备，甚至读取USB闪存内的音乐文件。</p><p>　　那么，苹果的CarPlay究竟和前者有何不同，为什么需要在整整7年后才姗姗来迟呢？</p><p>　　或许，这部分是由于汽车厂商需要一定的时间才能意识到自己此前对车载信息娱乐系统采取传统做法是注定失败的。在这一产业兴起之初，所谓的“车载信息娱乐系统”仅仅是包含了电台和一部CD播放器而已，因此汽车厂商需要做的仅仅是在自己的产线中增加一道将娱乐系统嵌入中控台的工序而已。但随着软件开始入侵车载中控台，汽车厂商便一下子感到无力招架了。而且，他们为汽车所配备的导航和娱乐系统的实用性相比智能手机和平板电脑应用依旧相去甚远。</p><p>　　当年福特和微软的结盟使得后者得以首次设计一套车载信息系统，但微软却始终没有找到正确的研发方向。当时，微软所开发的“Ford Sync”系统实际上就是一套基于车载中控台运行的车用Windows系统而已，但消费者真正需要的只是将车载系统同智能手机连接在一起而已。</p><p>　　事实上，在拥有一个智能手机、平板电脑接口、电源以及可接入音响系统的操作界面后，汽车用户实际上已经拥有一个熟悉的车载互联网生态环境。在这一环境下，我们可以进行存储音乐、播放流媒体、收听电台、导航、设定提醒事项、查看电话簿和社交媒体更新等操作。汽车消费者不需要另外一部设备来完成这些工作，而是希望能够继续使用我们日常生活中每天都会使用到的设备来进行替代。</p><p>　　毫无疑问的是，苹果很早就意识到了消费者的这一需求，但说服汽车厂商接受这一现实却需要花费更多的精力。通过推出CarPlay，苹果为驾驶者提供了异常简便、安全的在途互联网接入功能。</p><p>　　硝烟弥漫</p><p>　　与此同时，谷歌(微博)则凭借自己在2014年CES展会上宣布的“开放汽车联盟”(Open Auto Alliance)平台朝着相同的方向挺进。目前，谷歌对于这一平台并没有给出太多信息，但我们相信该公司的计划绝对不会是仅仅将Android系统照搬进汽车内部这么单纯。</p><p>　　随着苹果和谷歌加入战局，汽车产业也将迎来翻天覆地的变化。此前那些经常需要多人共用一辆车、时常租车的消费者甚至可以将个性化的车载娱乐和信息系统无缝带到任何一部车辆中。</p><p>　　有分析人士认为，围绕着苹果和谷歌这两大科技巨头车内空间之争的“智能汽车战争”已经拉开帷幕。目前，消费者对于车载娱乐信息系统的需求其实非常简单，他们需要的仅仅是通过一个类似于自己智能手机、平板电脑的操作界面来在驾驶途中（无论是自己的车辆还是租来的车辆）安全的控制导航、音乐和信息系统而已。</p><p>　　而且，由于智能手机已经成为了现代人类生活中不可分割的一部分，汽车厂商也需要避免作出僵化的硬性规定。比如，iOS消费者只能选择宝马，或者只有Andorid用户才能驾驶奥迪车型等。因为家庭中的不同成员可能拥有不同的设备型号，而且他们也会时不时的购买新设备。但显而易见的是，他们绝对不会因为购买了一部新手机而换车。</p><p>　　虽然有关智能汽车操作系统的战争很有可能围绕着苹果和谷歌两大企业之间展开，但汽车厂商却不会从一而终，因为他们都希望自己的车辆能够同尽可能多的设备建立连接。到目前为止，包括本田、通用和现代这些企业都已经同时成为了苹果和谷歌汽车系统阵营中的一员，且我们不认为这些厂商会对试图强制自己“选定阵营”的企图放弃抵抗。在另一方面，虽然为所有设备建立一个统一的汽车界面标准并非难事，但这一设想恐怕还不会在短期内成为现实。</p><p>　　未来远景</p><p>　　从目前的情况来看，苹果和谷歌的目标并不仅仅是占领汽车消费者的车载信息、娱乐系统这么简单，它们希望能够帮助驾驶者建立一个更为先进的自动汽车实时管理系统。换句话说就是，苹果和谷歌希望建立一个围绕汽车的物联网，并最终使车辆达到更安全、燃油经济性更高，且使驾驶者感到更加轻松的目标。要做到这一点的话，这两家公司就首先需要建立一个可以同其他车辆以及外部车流管理系统进行互动、允许车辆检测到其他车辆出现，同时尽可能避免事故发生的机制。</p><p>　　如果以上设想能够在苹果和谷歌的努力下最终成为现实的话，未来的驾驶员或将可以十分惬意的在行驶途中看电影、浏览Facebook更新、甚至闭上眼睛休息。</p><p><br/></p>', '苹果和谷歌希望建立一个围绕汽车的物联网，未来的驾驶员或将可以十分惬意的在行驶途中看电影、浏览Facebook更新、甚至闭上眼睛休息。', '2014-03-31 14:13:11', '2017-03-04 23:35:04', 148, 4, 100, 1, 0, '', 0, 1, 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_attachment`
--

DROP TABLE IF EXISTS `yy_attachment`;
CREATE TABLE `yy_attachment` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(60) NOT NULL DEFAULT '' COMMENT '原文件名',
  `file_path` varchar(200) NOT NULL DEFAULT '',
  `file_type` smallint(6) NOT NULL DEFAULT '1',
  `file_size` mediumint(8) UNSIGNED NOT NULL DEFAULT '0',
  `has_litpic` tinyint(1) NOT NULL DEFAULT '1',
  `upload_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_attachment`
--

INSERT INTO `yy_attachment` (`id`, `title`, `file_path`, `file_type`, `file_size`, `has_litpic`, `upload_time`, `aid`, `user_id`) VALUES
(7, 'db.txt', 'file1/20171006/59d767731aa89.txt', 0, 193, 0, '2017-10-06 19:22:27', 1, 0),
(6, '15.jpeg', 'img1/20171003/59d3920648cf1.jpeg', 1, 94429, 1, '2017-10-03 21:35:02', 1, 0),
(8, 'd8aae79735379998ed0ea11ac1f4cb0f.jpg', 'img1/20171013/59e0d6af5e9b9.jpg', 1, 149426, 1, '2017-10-13 23:07:27', 1, 0),
(9, '5e0807c866ce260a9620d84d84f28e85.jpg', 'img1/20171013/59e0db92c30e6.jpg', 1, 257304, 1, '2017-10-13 23:28:19', 1, 0),
(10, '2.jpg', 'file1/20171013/59e0dc525b757.jpg', 1, 180209, 0, '2017-10-13 23:31:30', 1, 0),
(11, '３.jpg', 'abc1/20171013/59e0dcb1df2f7.jpg', 1, 132003, 0, '2017-10-13 23:33:05', 1, 0),
(12, '２.jpg', 'img1/20171013/59e0de7d43502.jpg', 1, 319657, 1, '2017-10-13 23:40:45', 1, 0),
(13, '２.jpg', 'img1/20171017/59e60c5e3e5e3.jpg', 1, 319657, 1, '2017-10-17 21:57:50', 1, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_attachment_index`
--

DROP TABLE IF EXISTS `yy_attachment_index`;
CREATE TABLE `yy_attachment_index` (
  `att_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `arc_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `model_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `desc` varchar(20) NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `yy_auth_group`
--

DROP TABLE IF EXISTS `yy_auth_group`;
CREATE TABLE `yy_auth_group` (
  `id` mediumint(9) NOT NULL,
  `title` varchar(100) DEFAULT '',
  `description` varchar(200) DEFAULT '' COMMENT '描述',
  `status` tinyint(3) UNSIGNED DEFAULT '0',
  `rules` text,
  `department_id` int(11) DEFAULT '0' COMMENT '部门ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_auth_group`
--

INSERT INTO `yy_auth_group` (`id`, `title`, `description`, `status`, `rules`, `department_id`) VALUES
(1, '总经理', '总经理', 1, '1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,115,116,117,118,119,120,121,122,123,124,125', 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_auth_group_access`
--

DROP TABLE IF EXISTS `yy_auth_group_access`;
CREATE TABLE `yy_auth_group_access` (
  `uid` mediumint(8) UNSIGNED NOT NULL COMMENT '用户id',
  `group_id` mediumint(8) UNSIGNED NOT NULL COMMENT '用户组id'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_auth_group_access`
--

INSERT INTO `yy_auth_group_access` (`uid`, `group_id`) VALUES
(1, 1),
(2, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_auth_rule`
--

DROP TABLE IF EXISTS `yy_auth_rule`;
CREATE TABLE `yy_auth_rule` (
  `id` mediumint(8) UNSIGNED NOT NULL COMMENT '规则id,自增主键',
  `name` varchar(80) NOT NULL DEFAULT '' COMMENT '规则唯一英文标识',
  `title` varchar(20) NOT NULL DEFAULT '' COMMENT '规则中文描述',
  `type` tinyint(1) NOT NULL DEFAULT '1' COMMENT '类型[1支持表达式]',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否有效(0:无效,1:有效)',
  `pid` mediumint(8) UNSIGNED NOT NULL DEFAULT '0' COMMENT '父id',
  `condition` varchar(100) NOT NULL DEFAULT '' COMMENT '规则附加条件'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_auth_rule`
--

INSERT INTO `yy_auth_rule` (`id`, `name`, `title`, `type`, `status`, `pid`, `condition`) VALUES
(1, 'Manage/Public', '公共', 1, 1, 0, ''),
(2, 'Manage/MenuA1', '常规管理(1级菜单)', 1, 1, 1, ''),
(3, 'Manage/MenuA2', '模块管理(1级菜单)', 1, 1, 1, ''),
(4, 'Manage/MenuA3', '系统设置(1级菜单)', 1, 1, 1, ''),
(5, 'Manage/MenuA4', '其他管理(1级菜单)', 1, 1, 1, ''),
(6, 'Manage/MenuB1', '内容管理(2级菜单)', 1, 1, 1, ''),
(7, 'Manage/MenuB2', '快捷面板(2级菜单)', 1, 1, 1, ''),
(8, 'Manage/MenuB3', '内置模块(2级菜单)', 1, 1, 1, ''),
(9, 'Manage/MenuB4', '其他模块(2级菜单)', 1, 1, 1, ''),
(10, 'Manage/MenuB5', '扩展管理(2级菜单)', 1, 1, 1, ''),
(11, 'Manage/Category', '栏目管理', 1, 1, 0, ''),
(12, 'Manage/Category/index', '列表', 1, 1, 11, ''),
(13, 'Manage/Category/add', '添加', 1, 1, 11, ''),
(14, 'Manage/Category/edit', '修改', 1, 1, 11, ''),
(15, 'Manage/Category/del', '删除', 1, 1, 11, ''),
(16, 'Manage/Category/sort', '排序', 1, 1, 11, ''),
(17, 'Manage/Auth', '管理员权限', 1, 1, 0, ''),
(18, 'Manage/Auth/indexOfUser', '用户列表', 1, 1, 17, ''),
(19, 'Manage/Auth/addUser', '添加用户', 1, 1, 17, ''),
(20, 'Manage/Auth/editUser', '编辑用户', 1, 1, 17, ''),
(21, 'Manage/Auth/delUser', '删除用户', 1, 1, 17, ''),
(22, 'Manage/Auth/updateStatusOfUser', '锁定用户', 1, 1, 17, ''),
(23, 'Manage/Auth/index', ' 职位列表', 1, 1, 17, ''),
(24, 'Manage/Auth/addGroup', '添加职位', 1, 1, 17, ''),
(25, 'Manage/Auth/editGroup', '修改职位', 1, 1, 17, ''),
(26, 'Manage/Auth/updateGroup', '职位状态设置', 1, 1, 17, ''),
(27, 'Manage/Auth/access', '权限设置', 1, 1, 17, ''),
(28, 'Manage/Auth/rule', '规则列表', 1, 1, 17, ''),
(29, 'Manage/Auth/addRule', '添加规则', 1, 1, 17, ''),
(30, 'Manage/Auth/editRule', '修改规则', 1, 1, 17, ''),
(31, 'Manage/Auth/delRule', '删除规则', 1, 1, 17, ''),
(32, 'Manage/Department/index', '部门列表', 1, 1, 17, ''),
(33, 'Manage/Department/add', '添加部门', 1, 1, 17, ''),
(34, 'Manage/Department/edit', '修改部门', 1, 1, 17, ''),
(35, 'Manage/Department/del', '删除部门', 1, 1, 17, ''),
(36, 'Manage/System', '系统设置', 1, 1, 0, ''),
(37, 'Manage/System/site', '网站设置', 1, 1, 36, ''),
(38, 'Manage/System/url', '伪静态缓存设置', 1, 1, 36, ''),
(39, 'Manage/System/clearCache', '清除缓存', 1, 1, 36, ''),
(40, 'Manage/System/online', '在线客服', 1, 1, 36, ''),
(41, 'Manage/ClearHtml', '静态缓存', 1, 1, 0, ''),
(42, 'Manage/ClearHtml/all', '一键更新全站', 1, 1, 41, ''),
(43, 'Manage/ClearHtml/home', '更新首页', 1, 1, 41, ''),
(44, 'Manage/ClearHtml/lists', '更新栏目', 1, 1, 41, ''),
(45, 'Manage/ClearHtml/shows', '更新文档', 1, 1, 41, ''),
(46, 'Manage/ClearHtml/special', '更新专题', 1, 1, 41, ''),
(47, 'Manage/Personal', '我的账户', 1, 1, 0, ''),
(48, 'Manage/Personal/index', '修改资料', 1, 1, 47, ''),
(49, 'Manage/Personal/pwd', '修改密码', 1, 1, 47, ''),
(50, 'Manage/Member', '会员管理', 1, 1, 0, ''),
(51, 'Manage/Member/index', '会员列表', 1, 1, 50, ''),
(52, 'Manage/Member/add', '添加会员', 1, 1, 50, ''),
(53, 'Manage/Member/edit', '修改会员', 1, 1, 50, ''),
(54, 'Manage/Member/del', '删除会员', 1, 1, 50, ''),
(55, 'Manage/Membergroup/index', '会员组列表', 1, 1, 50, ''),
(56, 'Manage/Membergroup/add', '添加会员组', 1, 1, 50, ''),
(57, 'Manage/Membergroup/edit', '修改会员组', 1, 1, 50, ''),
(58, 'Manage/Membergroup/del', '删除会员', 1, 1, 50, ''),
(59, 'Manage/Model', '模型管理', 1, 1, 0, ''),
(60, 'Manage/Model/add', '添加', 1, 1, 59, ''),
(61, 'Manage/Model/edit', '修改', 1, 1, 59, ''),
(62, 'Manage/Model/del', '删除', 1, 1, 59, ''),
(63, 'Manage/Model/sort', '排序', 1, 1, 59, ''),
(64, 'Manage/Menu', '菜单管理', 1, 1, 0, ''),
(65, 'Manage/Menu/index', '列表', 1, 1, 64, ''),
(66, 'Manage/Menu/add', '添加', 1, 1, 64, ''),
(67, 'Manage/Menu/edit', '修改', 1, 1, 64, ''),
(68, 'Manage/Menu/del', '删除', 1, 1, 64, ''),
(69, 'Manage/Menu/sort', '排序', 1, 1, 64, ''),
(70, 'Manage/Menu/qk', '快捷面板', 1, 1, 64, ''),
(71, 'Manage/Database', '数据库管理', 1, 1, 0, ''),
(72, 'Manage/Database/index', '数据表列表', 1, 1, 71, ''),
(73, 'Manage/Database/optimize', '数据表优化', 1, 1, 71, ''),
(74, 'Manage/Database/repair', '数据表修复', 1, 1, 71, ''),
(75, 'Manage/Database/backup', '数据库备份', 1, 1, 71, ''),
(76, 'Manage/Database/restore', '还原管理', 1, 1, 71, ''),
(77, 'Manage/Database/restoreData', '数据恢复', 1, 1, 71, ''),
(78, 'Manage/Database/delSqlFiles', '删除文件', 1, 1, 71, ''),
(79, 'Manage/Itemgroup', '联动组管理', 1, 1, 0, ''),
(80, 'Manage/Itemgroup/index', '列表', 1, 1, 79, ''),
(81, 'Manage/Itemgroup/add', '添加', 1, 1, 79, ''),
(82, 'Manage/Itemgroup/edit', '修改', 1, 1, 79, ''),
(83, 'Manage/Itemgroup/del', '删除', 1, 1, 79, ''),
(84, 'Manage/Iteminfo', '联动管理', 1, 1, 0, ''),
(85, 'Manage/Iteminfo/index', '列表', 1, 1, 84, ''),
(86, 'Manage/Iteminfo/add', '添加', 1, 1, 84, ''),
(87, 'Manage/Iteminfo/edit', '修改', 1, 1, 84, ''),
(88, 'Manage/Iteminfo/del', '删除', 1, 1, 84, ''),
(89, 'Manage/Iteminfo/sort', '排序', 1, 1, 84, ''),
(90, 'Manage/Area', '区域管理', 1, 1, 0, ''),
(91, 'Manage/Area/index', '列表', 1, 1, 90, ''),
(92, 'Manage/Area/add', '添加', 1, 1, 90, ''),
(93, 'Manage/Area/edit', '修改', 1, 1, 90, ''),
(94, 'Manage/Area/del', '删除', 1, 1, 90, ''),
(95, 'Manage/Area/sort', '排序', 1, 1, 90, ''),
(96, 'Manage/Area/createJsArea', '生成JS', 1, 1, 90, ''),
(97, 'Manage/Meta', '数据元管理', 1, 1, 0, ''),
(98, 'Manage/Meta/index', '列表', 1, 1, 97, ''),
(99, 'Manage/Meta/add', '添加', 1, 1, 97, ''),
(100, 'Manage/Meta/edit', '修改', 1, 1, 97, ''),
(101, 'Manage/Meta/del', '删除', 1, 1, 97, ''),
(102, 'Manage/Attachment', '已上传文件管理', 1, 1, 0, ''),
(103, 'Manage/Attachment/index', '列表', 1, 1, 102, ''),
(104, 'Manage/Attachment/del', '删除', 1, 1, 102, ''),
(105, 'Manage/Templets', '模板管理', 1, 1, 0, ''),
(106, 'Manage/Templets/index', '列表', 1, 1, 105, ''),
(107, 'Manage/Templets/add', '添加', 1, 1, 105, ''),
(108, 'Manage/Templets/edit', '修改', 1, 1, 105, ''),
(109, 'Manage/Templets/del', '删除', 1, 1, 105, ''),
(110, 'Manage/Block', '自由块管理', 1, 1, 0, ''),
(111, 'Manage/Block/index', '列表', 1, 1, 110, ''),
(112, 'Manage/Block/add', '添加', 1, 1, 110, ''),
(113, 'Manage/Block/edit', '修改', 1, 1, 110, ''),
(114, 'Manage/Block/del', '删除', 1, 1, 110, ''),
(115, 'Manage/Abc', '广告管理', 1, 1, 0, ''),
(116, 'Manage/Abc/index', '广告位列表', 1, 1, 115, ''),
(117, 'Manage/Abc/add', '添加广告位', 1, 1, 115, ''),
(118, 'Manage/Abc/edit', '修改广告位', 1, 1, 115, ''),
(119, 'Manage/Abc/del', '删除广告位', 1, 1, 115, ''),
(120, 'Manage/Abc/getcode', '获取广告代码', 1, 1, 115, ''),
(121, 'Manage/Abc/detail', '广告列表', 1, 1, 115, ''),
(122, 'Manage/Abc/addDetail', '添加广告', 1, 1, 115, ''),
(123, 'Manage/Abc/editDetail', '修改广告', 1, 1, 115, ''),
(124, 'Manage/Abc/delDetail', '删除广告', 1, 1, 115, ''),
(125, 'Manage/Abc/sort', '广告排序', 1, 1, 115, ''),
(126, 'Manage/Special', '专题管理', 1, 1, 0, ''),
(127, 'Manage/Special/index', '列表', 1, 1, 126, ''),
(128, 'Manage/Special/add', '添加', 1, 1, 126, ''),
(129, 'Manage/Special/edit', '修改', 1, 1, 126, ''),
(130, 'Manage/Special/del', '删除', 1, 1, 126, ''),
(131, 'Manage/Special/trach', '回收站', 1, 1, 126, ''),
(132, 'Manage/Special/restore', '还原', 1, 1, 126, ''),
(133, 'Manage/Special/clear', '彻底删除', 1, 1, 126, ''),
(134, 'Manage/Announce', '公告管理', 1, 1, 0, ''),
(135, 'Manage/Announce/index', '列表', 1, 1, 134, ''),
(136, 'Manage/Announce/add', '添加', 1, 1, 134, ''),
(137, 'Manage/Announce/edit', '修改', 1, 1, 134, ''),
(138, 'Manage/Announce/del', '删除', 1, 1, 134, ''),
(139, 'Manage/Link', '友情链接', 1, 1, 0, ''),
(140, 'Manage/Link/index', '列表', 1, 1, 139, ''),
(141, 'Manage/Link/add', '添加', 1, 1, 139, ''),
(142, 'Manage/Link/edit', '修改', 1, 1, 139, ''),
(143, 'Manage/Link/del', '删除', 1, 1, 139, ''),
(144, 'Manage/Guestbook', '留言本管理', 1, 1, 0, ''),
(145, 'Manage/Guestbook/index', '列表', 1, 1, 144, ''),
(146, 'Manage/Guestbook/add', '添加', 1, 1, 144, ''),
(147, 'Manage/Guestbook/reply', '回复', 1, 1, 144, ''),
(148, 'Manage/Guestbook/del', '删除', 1, 1, 144, ''),
(149, 'Manage/Comment', '评论管理', 1, 1, 0, ''),
(150, 'Manage/Comment/index', '列表', 1, 1, 149, ''),
(151, 'Manage/Comment/edit', '编辑', 1, 1, 149, ''),
(152, 'Manage/Comment/del', '删除', 1, 1, 149, ''),
(153, 'Manage/System/index', '配置项管理', 1, 1, 36, ''),
(154, 'Manage/System/add', '添加配置项', 1, 1, 36, ''),
(155, 'Manage/System/edit', '修改配置项', 1, 1, 36, ''),
(156, 'Manage/System/del', '删除配置项', 1, 1, 36, ''),
(157, 'Manage/System/sort', '配置项排序', 1, 1, 36, ''),
(158, 'Manage/Auth/categoryAccess', '职位栏目权限', 1, 1, 17, ''),
(159, 'Manage/Membergroup/categoryAccess', '会员组栏目权限', 1, 1, 50, '');

-- --------------------------------------------------------

--
-- 表的结构 `yy_category`
--

DROP TABLE IF EXISTS `yy_category`;
CREATE TABLE `yy_category` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL DEFAULT '' COMMENT '栏目分类名称',
  `ename` varchar(200) NOT NULL DEFAULT '' COMMENT '别名',
  `cat_pic` varchar(150) NOT NULL DEFAULT '',
  `pid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '上级分类',
  `model_id` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '所属模型',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '类别',
  `seo_title` varchar(50) NOT NULL DEFAULT '',
  `keywords` varchar(50) DEFAULT '' COMMENT '关键字',
  `description` varchar(255) DEFAULT '' COMMENT '关键字',
  `template_category` varchar(60) NOT NULL DEFAULT '',
  `template_list` varchar(60) NOT NULL DEFAULT '',
  `template_show` varchar(60) NOT NULL DEFAULT '',
  `style` varchar(70) DEFAULT '' COMMENT 'css样式class',
  `content` text COMMENT '内容',
  `status` tinyint(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '显示',
  `sort` smallint(6) NOT NULL DEFAULT '100' COMMENT '排序'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='栏目分类表';

--
-- 转存表中的数据 `yy_category`
--

INSERT INTO `yy_category` (`id`, `name`, `ename`, `cat_pic`, `pid`, `model_id`, `type`, `seo_title`, `keywords`, `description`, `template_category`, `template_list`, `template_show`, `style`, `content`, `status`, `sort`) VALUES
(1, '公司介绍', 'about', '', 0, 2, 0, '', '公司介绍', '网络科技有限公司成立于2007年。是一家集科研、生产、开发、销售为一体的互联网产业高新技术企业。 我公司在全国与多个大型门户网站保持密切技术合作与往来；并且与全国多所高校合作，开发与研究互联网深度产品，取得了不错的研究成果，获得良好的好评', '', 'List_page.html', 'Show_article.html', '', '<p>　　网络科技有限公司成立于2007年。是一家集科研、生产、开发、销售为一体的互联网产业高新技术企业。 我公司在全国与多个大型门户网站保持密切技术合作与往来；并且与全国多所高校合作，开发与研究互联网深度产品，取得了不错的研究成果，获得良好的好评。公司具备优秀的技术梯队，多年来一直致力于以互联网为依托，开发各类型公司企业网站、行业网站、个人网站。以及销售涵盖国内大部分公司企业需要的成熟的管理配套软件、OA系统、定制系统等。还开展有域名注册、服务器托管租用等互联网基础数据业务。上谷网络品牌也是湖北互联网行业里的信得过品牌，为国内几万家企业提供互联网服务与咨询!<img src=\"/uploads/img1/20171003/59d3920648cf1.jpeg\" title=\"59d3920648cf1.jpeg\" alt=\"15.jpeg\"/></p>', 1, 1),
(2, '新闻中心', 'xinwenzhongxin', '', 0, 1, 0, '新闻中心', '', '', '', 'List_article.html', 'Show_article.html', '', NULL, 1, 2),
(3, '公司新闻', 'gongsixinwen', '', 2, 1, 0, '公司新闻', '', '', '', 'List_article.html', 'Show_article.html', '', NULL, 1, 1),
(4, '行业新闻', 'xingyexinwen', '', 2, 1, 0, '行业新闻', '', '', '', 'List_article.html', 'Show_article.html', '', NULL, 1, 1),
(5, '产品展示', 'chanpinzhanshi', '', 0, 3, 0, '产品展示', '', '', '', 'List_product.html', 'Show_product.html', '', NULL, 1, 3),
(6, '家具类', 'jiaju', '', 5, 3, 0, '家具产品', '', '', '', 'List_product.html', 'Show_product.html', '', NULL, 1, 1),
(7, '工艺品系列', 'gongyipinxilie', '', 5, 3, 0, '工艺品系列', '', '', '', 'List_product.html', 'Show_product.html', '', NULL, 1, 1),
(8, '公司相册', 'gongsixiangce', '', 0, 4, 0, '公司相册', '', '', '', 'List_picture.html', 'Show_picture.html', '', NULL, 1, 5),
(9, '在线留言', '@guestbook/index', '', 0, 0, 1, '', '', '', '', 'List_article.html', 'Show_article.html', '', NULL, 1, 6),
(10, '联系我们', 'lianxiwomen', '', 0, 2, 0, '联系我们', '', '欢迎光临！&nbsp;公司地址：云南省昆明市北京路299&nbsp;公司电话：0871-100000售前咨询客服QQ-01：售前咨询客服QQ-02：客户售前咨询热线：客户售后服务热线：客服信箱：&nbsp;&nbsp;', '', 'List_page.html', 'Show_article.html', '', '<p>欢迎光临！</p><p>&nbsp;</p><p>公司地址：云南省昆明市北京路299<br/>&nbsp;</p><p>公司电话：0871-100000</p><p>售前咨询客服QQ-01：<br/>售前咨询客服QQ-02：<br/>客户售前咨询热线：<br/>客户售后服务热线：<br/>客服信箱：</p><p>&nbsp;</p><p>&nbsp;</p>', 1, 7),
(11, '精彩专题', '@special/index', '', 0, 0, 1, '', '', '', '', 'List_article.html', 'Show_article.html', '', NULL, 1, 1),
(12, '软件下载', 'ruanjianxiazai', '', 0, 5, 0, '', '', '', '', 'List_soft.html', 'Show_soft.html', '', NULL, 1, 20);

-- --------------------------------------------------------

--
-- 表的结构 `yy_category_access`
--

DROP TABLE IF EXISTS `yy_category_access`;
CREATE TABLE `yy_category_access` (
  `cat_id` smallint(5) UNSIGNED NOT NULL DEFAULT '0',
  `role_id` smallint(5) UNSIGNED NOT NULL DEFAULT '0',
  `flag` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `action` varchar(30) NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_category_access`
--

INSERT INTO `yy_category_access` (`cat_id`, `role_id`, `flag`, `action`) VALUES
(4, 1, 1, 'clear'),
(4, 1, 1, 'restore'),
(4, 1, 1, 'trach'),
(4, 1, 1, 'move'),
(4, 1, 1, 'del'),
(4, 1, 1, 'edit'),
(4, 1, 1, 'add'),
(4, 1, 1, 'index'),
(3, 1, 1, 'clear'),
(3, 1, 1, 'restore'),
(3, 1, 1, 'trach'),
(3, 1, 1, 'move'),
(3, 1, 1, 'del'),
(3, 1, 1, 'edit'),
(3, 1, 1, 'add'),
(3, 1, 1, 'index'),
(2, 1, 1, 'clear'),
(2, 1, 1, 'restore'),
(2, 1, 1, 'trach'),
(2, 1, 1, 'move'),
(2, 1, 1, 'del'),
(2, 1, 1, 'edit'),
(2, 1, 1, 'add'),
(2, 1, 1, 'index'),
(11, 1, 1, 'del'),
(11, 1, 1, 'edit'),
(11, 1, 1, 'add'),
(11, 1, 1, 'index'),
(1, 1, 1, 'del'),
(1, 1, 1, 'edit'),
(1, 1, 1, 'add'),
(1, 1, 1, 'index');

-- --------------------------------------------------------

--
-- 表的结构 `yy_comment`
--

DROP TABLE IF EXISTS `yy_comment`;
CREATE TABLE `yy_comment` (
  `id` int(10) UNSIGNED NOT NULL,
  `post_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `model_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `title` varchar(100) NOT NULL DEFAULT '',
  `username` varchar(30) NOT NULL DEFAULT '',
  `email` varchar(100) NOT NULL DEFAULT '',
  `ip` varchar(20) NOT NULL DEFAULT '',
  `agent` varchar(255) NOT NULL DEFAULT '',
  `post_time` datetime NOT NULL,
  `content` text NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '0',
  `pid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_comment`
--

INSERT INTO `yy_comment` (`id`, `post_id`, `model_id`, `title`, `username`, `email`, `ip`, `agent`, `post_time`, `content`, `status`, `pid`, `user_id`) VALUES
(1, 1, 1, '44444', '555', '', '', '', '2017-10-02 00:00:00', '不求上进睦', 0, 0, 1),
(2, 12, 1, '智能汽车战场硝烟弥漫 苹果谷歌双雄对决', '小明', 'zhao@163.com', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36', '2017-10-06 22:59:59', '4444', 0, 0, 2);

-- --------------------------------------------------------

--
-- 表的结构 `yy_config`
--

DROP TABLE IF EXISTS `yy_config`;
CREATE TABLE `yy_config` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL DEFAULT '' COMMENT '标识',
  `title` varchar(50) NOT NULL DEFAULT '' COMMENT '名称',
  `remark` varchar(100) NOT NULL DEFAULT '' COMMENT '说明',
  `t_value` varchar(150) NOT NULL DEFAULT '' COMMENT 'html元素类型',
  `type_id` smallint(5) UNSIGNED NOT NULL DEFAULT '0' COMMENT '类型',
  `group_id` smallint(5) UNSIGNED NOT NULL DEFAULT '0' COMMENT '分组',
  `s_value` text COMMENT '值',
  `sort` smallint(3) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_config`
--

INSERT INTO `yy_config` (`id`, `name`, `title`, `remark`, `t_value`, `type_id`, `group_id`, `s_value`, `sort`) VALUES
(1, 'CFG_WEBNAME', '网站名称', '', '', 2, 1, '我的网站', 0),
(2, 'CFG_WEBURL', '网站域名', '', '', 2, 1, 'http://t.com', 0),
(3, 'CFG_WEBTITLE', '网站标题', '站点首页title(SEO)的设置', '', 2, 1, '我的网站！！！！', 0),
(4, 'CFG_KEYWORDS', '站点关键词', '', '', 2, 1, '我的网站，个人网站', 0),
(5, 'CFG_DESCRIPTION', '站点描述', '', 'textarea', 3, 1, '', 0),
(6, 'CFG_THEMESTYLE', '模板风格', '', 'select\r\n__CFG_THEMESTYLE__', 2, 1, 'default', 0),
(7, 'CFG_COOKIE_ENCODE', 'cookie加密码', '', '', 2, 1, 'nI24SMRDe', 0),
(8, 'CFG_POWERBY', '网站版权信息', '', 'textarea', 3, 1, '', 0),
(9, 'CFG_STATS', '网站统计', '', 'textarea', 3, 1, '', 0),
(10, 'CFG_BEIAN', '网站备案号', '', '', 2, 1, '', 0),
(11, 'CFG_ADDRESS', '联系地址', '', '', 2, 1, '昆明北京路', 0),
(12, 'CFG_PHONE', '联系电话', '', '', 2, 1, '0871-66666', 0),
(13, 'CFG_WEBSITE_CLOSE', '关闭网站', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '0', 0),
(14, 'CFG_WEBSITE_CLOSE_INFO', '关站提示', '', 'textarea', 3, 2, '站点维护中，请稍等一会...', 0),
(15, 'CFG_MOBILE_AUTO', '手机版开启', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '1', 1),
(16, 'CFG_EMAIL_FROM', '发件邮箱地址', '', '', 2, 3, 'ddend@qq.com', 0),
(17, 'CFG_EMAIL_FROM_NAME', '发件人名称', '', '', 2, 3, '站名', 0),
(18, 'CFG_EMAIL_HOST', 'STMP服务器', '', '', 2, 3, 'smtp.exmail.qq.com', 0),
(19, 'CFG_EMAIL_PORT', '服务器端口', '', '', 1, 3, '25', 0),
(20, 'CFG_EMAIL_LOGINNAME', '邮箱帐号', '', '', 2, 3, 'ddend@qq.com', 0),
(21, 'CFG_EMAIL_PASSWORD', '邮箱密码', '', '', 2, 3, '123zstQhz4', 0),
(22, 'CFG_BADWORD', '禁用词语', '', 'textarea', 3, 2, '艾滋病|中国共产党|111111111', 0),
(23, 'CFG_FEEDBACK_GUEST', '允许匿名评论', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '1', 0),
(24, 'CFG_MEMBER_OPEN', '开启会员功能', '', 'radio\r\n1:::是\r\n0:::否', 4, 5, '1', 0),
(25, 'CFG_MEMBER_VERIFYEMAIL', ' 开启邮件验证', '', 'radio\r\n1:::是\r\n0:::否', 4, 5, '0', 0),
(26, 'CFG_MEMBER_NOTALLOW', '禁止使用的昵称', '', 'textarea', 3, 5, 'www,bbs,ftp,mail,user,users,admin,administrator,xyhcms', 0),
(27, 'CFG_UPLOAD_MAXSIZE', '允许上传大小', 'KB', '', 1, 4, '2048', 0),
(28, 'CFG_IMGTHUMB_SIZE', '缩略图组尺寸', '长X高，长X0(固定宽度)，一个尺寸一行，如：300X300 600X0', 'textarea', 5, 4, '300X300\r\n600X0', 0),
(29, 'CFG_IMGTHUMB_TYPE', '缩略图生成方式', '固定大小截取 ,原图等比例缩略', 'radio\r\n0:::原图等比例缩略\r\n1:::固定大小截取', 4, 4, '0', 0),
(31, 'CFG_UPLOAD_ROOTPATH', '上传根目录', '', '', 2, 4, './uploads/', 0),
(32, 'CFG_UPLOAD_FILE_EXT', '允许附件类型', '', 'textarea', 3, 4, 'jpg,gif,png,jpeg,txt,doc,docx,xls,ppt,zip,rar,mp3', 0),
(33, 'CFG_UPLOAD_IMG_EXT', '允许图片类型', '带缩略图的图片', '', 2, 4, 'jpg,gif,png,jpeg', 0),
(34, 'CFG_VERIFY_REGISTER', '开启注册验证码', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '0', 0),
(35, 'CFG_VERIFY_LOGIN', '开启登录验证码', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '0', 0),
(36, 'CFG_VERIFY_GUESTBOOK', '开启留言板验证码', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '1', 0),
(37, 'CFG_VERIFY_REVIEW', '开启评论验证码', '', 'radio\r\n1:::是\r\n0:::否', 4, 2, '1', 0),
(38, 'CFG_SQL_FILESIZE', 'sql文件大小', '备份数据库，值不可太大，否则会导致内存溢出备份、恢复失败，合理大小在512K~10M间，建议3M一卷。单位字节,5M=5*1024*1024=5242880', '', 1, 6, '5242880', 0),
(39, 'CFG_DOWNLOAD_HIDE', '隐藏下载地址', '', 'radio\r\n1:::是\r\n0:::否', 4, 4, '1', 0),
(40, 'CFG_MOBILE_THEMESTYLE', '手机模板风格', '', 'select\r\n__CFG_MOBILE_THEMESTYLE__', 2, 2, 'blog', 1),
(41, 'HOME_URL_MODEL', 'URL模式', '', 'radio\r\n0:::普通模式\r\n1:::PATHINFO模式\r\n2:::REWRITE模式(需要URL_REWRITE支持)\r\n3:::兼容模式', 1, 900, '2', 0),
(42, 'HOME_URL_PATHINFO_DEPR', '参数分割符', '针对PATHINFO模式,默认为&quot;/&quot;,如改为&quot;-&quot;：http://www.xyhcms.com/index.php/List-index-id-1', '', 2, 900, '/', 0),
(43, 'HOME_URL_ROUTER_ON', '开启路由', '开启URL路由(路由规则不熟悉的不要乱改)', 'radio\r\n1:::是\r\n0:::否', 4, 900, '1', 0),
(44, 'HOME_URL_ROUTE_RULES', '路由规则', '路由规则不熟悉的不要乱改', 'textarea', 5, 900, 'Mobile$:::Mobile/Index/index\r\nSpecial/:id\\d:::Special/shows\r\nTag/:tname\\w:::Tag/shows\r\n:e/p/:p\\d:::List/index\r\n:e/:id\\d:::Show/index\r\n/^(\\w+)$/:::List/index?e=:1', 0),
(45, 'HOME_HTML_CACHE_ON', '开启电脑版缓存', '开启电脑版缓存', 'radio\r\n1:::是\r\n0:::否', 4, 900, '0', 0),
(46, 'MOBILE_HTML_CACHE_ON', '开启手机版缓存', '', 'radio\r\n1:::是\r\n0:::否', 4, 900, '0', 0),
(47, 'HTML_CACHE_INDEX_ON', '首页缓存', '', 'radio\r\n1:::是\r\n0:::否', 4, 900, '1', 0),
(48, 'HTML_CACHE_INDEX_TIME', '首页缓存时间', '首页缓存时间', '', 1, 900, '1200', 0),
(49, 'HTML_CACHE_LIST_ON', '栏目缓存', '', 'radio\r\n1:::是\r\n0:::否', 4, 900, '1', 0),
(50, 'HTML_CACHE_LIST_TIME', '栏目缓存时间', '栏目缓存时间', '', 1, 900, '0', 0),
(51, 'HTML_CACHE_SHOW_ON', '文章缓存', '', 'radio\r\n1:::是\r\n0:::否', 4, 900, '1', 0),
(52, 'HTML_CACHE_SHOW_TIME', '文章缓存时间', '', '', 1, 900, '0', 0),
(53, 'HTML_CACHE_SPECIAL_ON', '专题缓存', '', 'radio\r\n1:::是\r\n0:::否', 4, 900, '0', 0),
(54, 'HTML_CACHE_SPECIAL_TIME', '专题缓存时间', '专题缓存时间', '', 1, 900, '0', 0),
(55, 'ONLINE_CFG_MODE', '客服显示状态', '', 'radio\r\n1:::显示\r\n0:::隐藏', 4, 901, '1', 0),
(56, 'ONLINE_CFG_STYLE', '客服样式', '', 'select\r\n__ONLINE_CFG_STYLE__', 2, 901, 'blue', 0),
(57, 'ONLINE_CFG_H', '水平位置', '设置水平显示位置', 'radio\r\n0:::左对齐\r\n1:::右对齐\r\n2:::水平居中', 1, 901, '1', 0),
(58, 'ONLINE_CFG_H_MARGIN', '与边界的距离', '水平位置与边界的距离(像素)', '', 1, 901, '0', 0),
(59, 'ONLINE_CFG_V', '垂直位置', '', 'radio\r\n0:::顶部对齐\r\n1:::底部对齐\r\n2:::垂直居中', 1, 901, '2', 0),
(60, 'ONLINE_CFG_V_MARGIN', '与边界的距离', '垂直位置与边界的距离(像素)', '', 1, 901, '0', 0),
(61, 'ONLINE_CFG_QQ', 'QQ号码', '一行一个QQ号(QQ:::说明)', 'textarea', 5, 901, '销售咨询:::307299635\r\n售后服务:::307299635', 0),
(62, 'ONLINE_CFG_WANGWANG', '旺旺号码', '一行一个旺旺号(旺旺:::说明)', 'textarea', 5, 901, '在线旺旺:::7bucn', 0),
(63, 'ONLINE_CFG_PHONE_ON', '显示电话', '', 'radio\r\n1:::显示\r\n0:::隐藏', 4, 901, '1', 0),
(64, 'ONLINE_CFG_PHONE', '电话号码', '一行一个电话号码(电话号码:::说明)', 'textarea\r\n', 5, 901, '销售热线:::6525411\r\n技术支持:::6525412', 0),
(65, 'ONLINE_CFG_GUESTBOOK_ON', '显示留言链接', '显示留言链接', 'radio\r\n1:::显示\r\n0:::隐藏', 2, 901, '1', 0),
(66, 'ONLINE_CFG_QQ_PARAM', 'QQ参数', 'QQ参数。不熟悉的，请不要动', 'textarea', 3, 901, '<a target=\"_blank\" href=\"http://wpa.qq.com/msgrd?v=3&uin=[客服号]&site=qq&menu=yes\" class=\"xyh-online-item\"><em class=\"xyh-online-ico-qq\"> </em>[客服说明]</a>', 0),
(67, 'ONLINE_CFG_WANGWANG_PARAM', '旺旺参数', 'QQ参数。不熟悉的，请不要动', 'textarea', 3, 901, '<a target=\"_blank\" href=\"http://www.taobao.com/webww/ww.php?ver=3&touid=[客服号]&siteid=cntaobao&status=1&charset=utf-8\" class=\"xyh-online-item\"><em class=\"xyh-online-ico-wangwang\"> </em>[客服说明]</a>', 0),
(68, 'CFG_IMAGE_WATER_ON', '上传图片加水印', '水印开启，同时会影响到缩略图', 'radio\r\n1:::开启\r\n0:::关闭', 4, 4, '1', 0),
(69, 'CFG_IMAGE_WATER_FILE', '水印图片文件', '', 'file@ad', 2, 4, '/uploads/abc1/20171102/59fa9a98da71f.png', 0),
(70, 'CFG_IMAGE_WATER_POSITION', '水印位置', '', 'radio\r\n1:::顶部居左\r\n2:::顶部居中\r\n3:::顶部居右\r\n4:::左边居中\r\n5:::图片中心\r\n6:::右边居中\r\n7:::底部居左\r\n8:::底部居中\r\n9:::底部居右\r\n', 1, 4, '9', 0),
(71, 'CFG_IMAGE_WATER_DIAPHANEITY', '水印透明度', '透明度0~100之间，超小超透明', 'text', 1, 4, '100', 0),
(72, 'CFG_IMAGE_WATER_IGNORE_WIDTH', '加水印最小宽度', '上传的图片宽度小于最小宽度(像素)，则不再添加水印。全部添加水印，请填写0', '', 2, 4, '300', 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_copyfrom`
--

DROP TABLE IF EXISTS `yy_copyfrom`;
CREATE TABLE `yy_copyfrom` (
  `id` int(10) UNSIGNED NOT NULL,
  `sitename` varchar(30) NOT NULL DEFAULT '',
  `siteurl` varchar(200) NOT NULL DEFAULT '',
  `sort` int(10) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `yy_department`
--

DROP TABLE IF EXISTS `yy_department`;
CREATE TABLE `yy_department` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'ID',
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '部门名称',
  `pid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '上级部门',
  `description` varchar(200) NOT NULL DEFAULT '' COMMENT '描述',
  `sorting` int(10) UNSIGNED DEFAULT '0' COMMENT '排序'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_department`
--

INSERT INTO `yy_department` (`id`, `name`, `pid`, `description`, `sorting`) VALUES
(1, '网络部', 0, '网络部', 0),
(3, '销售部', 0, '销售', 1),
(4, '美工部', 1, '美工', 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_free_block`
--

DROP TABLE IF EXISTS `yy_free_block`;
CREATE TABLE `yy_free_block` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '名称',
  `remark` varchar(200) NOT NULL DEFAULT '' COMMENT '说明',
  `content` text COMMENT '内容',
  `block_type` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '类型'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_free_block`
--

INSERT INTO `yy_free_block` (`id`, `name`, `remark`, `content`, `block_type`) VALUES
(1, 'Introduction', 'fgf', '<p>网络科技有限公司成立于2007年。是一家集科研、生产、开发、销售为一体的互联网产业高新技术企业。 我公司在全国与多个大型门户网站保持密切技术合作与往来；并且与全国多所高校合作，开发与研究互联网深度产品，取得了不错的研究成果，获得良好的好评</p>', 3);

-- --------------------------------------------------------

--
-- 表的结构 `yy_guestbook`
--

DROP TABLE IF EXISTS `yy_guestbook`;
CREATE TABLE `yy_guestbook` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(30) NOT NULL DEFAULT '',
  `tel` varchar(50) NOT NULL DEFAULT '',
  `email` varchar(50) NOT NULL DEFAULT '',
  `homepage` varchar(50) NOT NULL DEFAULT '',
  `qq` varchar(15) NOT NULL DEFAULT '',
  `ip` varchar(20) NOT NULL DEFAULT '',
  `post_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `reply_time` datetime DEFAULT NULL COMMENT '更新时间',
  `status` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `private_flag` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '悄悄话',
  `content` text,
  `reply` text,
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_guestbook`
--

INSERT INTO `yy_guestbook` (`id`, `username`, `tel`, `email`, `homepage`, `qq`, `ip`, `post_time`, `reply_time`, `status`, `private_flag`, `content`, `reply`, `user_id`) VALUES
(1, '小平', '', '', '', '', '112.115.215.93', '2014-03-31 13:35:41', '2014-04-01 15:43:55', 1, 0, '网站不错，很喜欢！！！', '谢谢支持！', 0),
(2, '明明', '', '', '', '', '112.115.192.30', '2014-04-01 15:38:26', NULL, 1, 0, '蓝色很大气，模板很好看！', NULL, 0),
(3, 'ggg', 'ggggg', '', '', '', '127.0.0.1', '2017-08-17 23:30:10', NULL, 0, 0, 'ffff', NULL, 0),
(4, 'ffff', 'fff', '', '', '', '127.0.0.1', '2017-08-17 23:31:25', NULL, 0, 0, 'ffff45444', NULL, 0),
(5, 'ffff', '', '', '', '', '127.0.0.1', '2017-08-17 23:57:42', '2017-10-02 22:55:17', 1, 1, 'ffff', '<p>hhhhh</p>', 0),
(7, '小明', '56651', 'admin@admin.com', '', '470712', '127.0.0.1', '2017-10-06 19:52:01', '2017-10-06 21:41:02', 1, 1, 'dddd', NULL, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_item_group`
--

DROP TABLE IF EXISTS `yy_item_group`;
CREATE TABLE `yy_item_group` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL,
  `remark` varchar(20) DEFAULT '',
  `status` tinyint(1) UNSIGNED DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_item_group`
--

INSERT INTO `yy_item_group` (`id`, `name`, `remark`, `status`) VALUES
(1, 'flagtype', '文档属性', 0),
(2, 'blocktype', '自由块类别', 0),
(3, 'softtype', '软件类型', 0),
(4, 'softlanguage', '软件语言', 0),
(5, 'star', '星座', 0),
(6, 'animal', '生肖', 0),
(7, 'education', '教育程度', 0),
(8, 'configgroup', '配置分组', 0),
(9, 'configtype', '配置变量类型', 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_item_info`
--

DROP TABLE IF EXISTS `yy_item_info`;
CREATE TABLE `yy_item_info` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL,
  `group` varchar(20) NOT NULL,
  `value` int(11) NOT NULL DEFAULT '0',
  `pid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `sort` smallint(6) NOT NULL DEFAULT '0' COMMENT '排序'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_item_info`
--

INSERT INTO `yy_item_info` (`id`, `name`, `group`, `value`, `pid`, `sort`) VALUES
(1, '图片', 'flagtype', 1, 0, 0),
(2, '头条', 'flagtype', 2, 0, 0),
(3, '推荐', 'flagtype', 4, 0, 0),
(4, '特荐', 'flagtype', 8, 0, 0),
(5, '幻灯', 'flagtype', 16, 0, 0),
(6, '跳转', 'flagtype', 32, 0, 0),
(7, '其他', 'flagtype', 64, 0, 0),
(8, '文字', 'blocktype', 1, 0, 0),
(9, '图片', 'blocktype', 2, 0, 0),
(10, '丰富', 'blocktype', 3, 0, 0),
(11, '国产', 'softtype', 1, 0, 0),
(12, '中文版', 'softlanguage', 1, 0, 0),
(13, '英文版', 'softlanguage', 2, 0, 0),
(14, '多语言版', 'softlanguage', 3, 0, 0),
(15, '白羊座', 'star', 1, 0, 0),
(16, '金牛座', 'star', 2, 0, 0),
(17, '双子座', 'star', 3, 0, 0),
(18, '巨蟹座', 'star', 4, 0, 0),
(19, '狮子座', 'star', 5, 0, 0),
(20, '处女座', 'star', 6, 0, 0),
(21, '天枰座', 'star', 7, 0, 0),
(22, '天蝎座', 'star', 8, 0, 0),
(23, '射手座', 'star', 9, 0, 0),
(24, '摩羯座', 'star', 10, 0, 0),
(25, '水瓶座', 'star', 11, 0, 0),
(26, '双鱼座', 'star', 12, 0, 0),
(27, '鼠', 'animal', 1, 0, 0),
(28, '牛', 'animal', 2, 0, 0),
(29, '虎', 'animal', 3, 0, 0),
(30, '兔', 'animal', 4, 0, 0),
(31, '龙', 'animal', 5, 0, 0),
(32, '蛇', 'animal', 6, 0, 0),
(33, '马', 'animal', 7, 0, 0),
(34, '羊', 'animal', 8, 0, 0),
(35, '猴', 'animal', 9, 0, 0),
(36, '鸡', 'animal', 10, 0, 0),
(37, '狗', 'animal', 11, 0, 0),
(38, '猪', 'animal', 12, 0, 0),
(39, '小学', 'education', 1, 0, 0),
(40, '初中', 'education', 2, 0, 0),
(41, '高中/中专', 'education', 3, 0, 0),
(42, '大学专科', 'education', 4, 0, 0),
(43, '大学本科', 'education', 5, 0, 0),
(44, '硕士', 'education', 6, 0, 0),
(45, '博士以上', 'education', 7, 0, 0),
(46, '站点配置', 'configgroup', 1, 0, 0),
(47, '核心配置', 'configgroup', 2, 0, 0),
(48, '邮箱配置', 'configgroup', 3, 0, 0),
(49, '上传配置', 'configgroup', 4, 0, 0),
(50, '会员配置', 'configgroup', 5, 0, 0),
(51, '其他配置', 'configgroup', 6, 0, 0),
(52, '数字', 'configtype', 1, 0, 0),
(53, '字符', 'configtype', 2, 0, 0),
(54, '文本', 'configtype', 3, 0, 0),
(55, '布尔(真假)', 'configtype', 4, 0, 0),
(56, '数组', 'configtype', 5, 0, 0),
(57, '伪静态/缓存', 'configgroup', 900, 0, 0),
(58, '在线客服', 'configgroup', 901, 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_link`
--

DROP TABLE IF EXISTS `yy_link`;
CREATE TABLE `yy_link` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL DEFAULT '',
  `url` varchar(255) NOT NULL DEFAULT '',
  `logo` varchar(255) NOT NULL DEFAULT '',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '描述',
  `is_check` tinyint(1) NOT NULL DEFAULT '1' COMMENT '首页|内页',
  `post_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `sort` smallint(5) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_link`
--

INSERT INTO `yy_link` (`id`, `name`, `url`, `logo`, `description`, `is_check`, `post_time`, `sort`) VALUES
(1, '行云海CMS', 'http://www.xyhcms.com', '', '', 0, '2014-03-31 16:40:03', 1),
(2, '行云海软件', 'http://www.0871k.com', '', '', 0, '2014-03-31 16:40:03', 1),
(3, '许愿网', 'http://www.yuanabc.com', '', '', 1, '2014-03-31 16:40:03', 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_member`
--

DROP TABLE IF EXISTS `yy_member`;
CREATE TABLE `yy_member` (
  `id` int(10) UNSIGNED NOT NULL,
  `email` varchar(50) NOT NULL,
  `password` char(32) NOT NULL,
  `encrypt` varchar(6) NOT NULL DEFAULT '',
  `nickname` varchar(20) DEFAULT '',
  `amount` decimal(8,2) UNSIGNED NOT NULL DEFAULT '0.00' COMMENT '总金额',
  `score` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '积分',
  `face` varchar(60) NOT NULL DEFAULT '' COMMENT '头像',
  `reg_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `login_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `login_ip` varchar(20) DEFAULT '',
  `login_num` int(10) UNSIGNED DEFAULT '0',
  `group_id` int(10) UNSIGNED DEFAULT '0',
  `message` tinyint(1) DEFAULT '0',
  `status` tinyint(1) NOT NULL DEFAULT '0',
  `is_lock` tinyint(1) DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_member`
--

INSERT INTO `yy_member` (`id`, `email`, `password`, `encrypt`, `nickname`, `amount`, `score`, `face`, `reg_time`, `login_time`, `login_ip`, `login_num`, `group_id`, `message`, `status`, `is_lock`) VALUES
(1, '123456@163.com', '78611981f0a657aaff95a1857438d3d1', '5G78sc', '小鸟', '0.00', 0, '', '2017-06-20 21:55:44', '2017-06-20 21:55:50', '127.0.0.1', 1, 2, 0, 0, 0),
(2, 'zhao@163.com', 'f3adde31be7a82e3a1fd77f5f65bbe17', '2g3FtS', '小明', '0.00', 0, '', '1900-01-01 00:00:00', '2017-10-06 23:33:42', '127.0.0.1', 2, 2, 0, 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_member_detail`
--

DROP TABLE IF EXISTS `yy_member_detail`;
CREATE TABLE `yy_member_detail` (
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `sex` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `realname` varchar(30) NOT NULL DEFAULT '',
  `birthday` date NOT NULL DEFAULT '1980-01-01',
  `province` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `area` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `address` varchar(50) NOT NULL DEFAULT '',
  `qq` varchar(12) NOT NULL DEFAULT '',
  `tel` varchar(15) NOT NULL DEFAULT '',
  `mobile` varchar(15) NOT NULL DEFAULT '',
  `animal` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `star` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `blood` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `marital` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `education` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `vocation` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `income` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `maxim` varchar(100) NOT NULL DEFAULT '',
  `update_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_member_detail`
--

INSERT INTO `yy_member_detail` (`user_id`, `sex`, `realname`, `birthday`, `province`, `area`, `address`, `qq`, `tel`, `mobile`, `animal`, `star`, `blood`, `marital`, `education`, `vocation`, `income`, `maxim`, `update_time`) VALUES
(2, 0, 'ggg', '1990-01-01', 0, 0, '', '', '', '', 0, 0, 0, 0, 0, 0, 0, '', '1900-01-01 00:00:00');

-- --------------------------------------------------------

--
-- 表的结构 `yy_member_group`
--

DROP TABLE IF EXISTS `yy_member_group`;
CREATE TABLE `yy_member_group` (
  `id` smallint(6) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL DEFAULT '',
  `description` varchar(255) DEFAULT '',
  `rank` smallint(6) NOT NULL DEFAULT '0',
  `status` tinyint(1) DEFAULT '0',
  `sort` tinyint(3) UNSIGNED DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_member_group`
--

INSERT INTO `yy_member_group` (`id`, `name`, `description`, `rank`, `status`, `sort`) VALUES
(1, '游客', '', 0, 0, 0),
(2, '注册会员', '', 10, 0, 0),
(3, '中级会员', '', 30, 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `yy_menu`
--

DROP TABLE IF EXISTS `yy_menu`;
CREATE TABLE `yy_menu` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL DEFAULT '',
  `url` varchar(255) NOT NULL DEFAULT '' COMMENT '链接地址',
  `pid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `quick` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `status` tinyint(1) UNSIGNED NOT NULL DEFAULT '0' COMMENT '显示',
  `sort` smallint(6) NOT NULL DEFAULT '100'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_menu`
--

INSERT INTO `yy_menu` (`id`, `name`, `url`, `pid`, `quick`, `status`, `sort`) VALUES
(1, '常规管理', 'Manage/MenuA1', 0, 0, 1, 1),
(2, '模块扩展', 'Manage/MenuA2', 0, 0, 1, 2),
(3, '系统设置', 'Manage/MenuA3', 0, 0, 1, 3),
(4, '预留管理', 'Manage/MenuA4', 0, 0, 1, 4),
(5, '栏目管理', 'Manage/Category', 1, 0, 1, 11),
(6, '内容管理', 'Manage/MenuB1', 1, 0, 1, 12),
(7, '快捷面板', 'Manage/MenuB2', 1, 0, 1, 13),
(8, '栏目管理', 'Manage/Category/index', 5, 0, 1, 111),
(9, '内置模块', 'Manage/MenuB3', 2, 0, 1, 21),
(10, '自由块管理', 'Manage/FreeBlock/index', 9, 0, 1, 211),
(11, '广告管理', 'Manage/Abc/index', 9, 1, 1, 212),
(12, '专题管理', 'Manage/Special/index', 9, 0, 1, 213),
(13, '公告管理', 'Manage/Announce/index', 9, 1, 1, 214),
(14, '友情链接', 'Manage/Link/index', 9, 1, 1, 215),
(15, '留言本管理', 'Manage/Guestbook/index', 9, 1, 1, 216),
(16, '评论管理', 'Manage/Comment/index', 9, 1, 1, 217),
(17, '系统设置', 'Manage/System', 3, 0, 1, 31),
(18, '会员管理', 'Manage/Member', 3, 0, 1, 34),
(19, '管理员管理', 'Manage/Auth', 3, 0, 1, 35),
(20, '网站设置', 'Manage/System/site', 17, 0, 1, 311),
(21, '伪静态|缓存设置', 'Manage/System/url', 17, 0, 1, 312),
(22, '清除系统缓存', 'Manage/System/clearCache', 17, 1, 1, 316),
(23, '在线客服设置', 'Manage/System/online', 17, 0, 1, 313),
(24, '更新静态缓存', 'Manage/ClearHtml/index', 17, 0, 1, 317),
(30, '会员管理', 'Manage/Member/index', 18, 0, 1, 331),
(31, '会员组管理', 'Manage/MemberGroup/index', 18, 0, 1, 332),
(32, '系统用户管理', 'Manage/Auth/indexOfUser', 19, 0, 1, 341),
(33, '职位权限', 'Manage/Auth/index', 19, 0, 1, 342),
(34, '部门管理', 'Manage/Department/index', 19, 0, 1, 343),
(35, '扩展管理', 'Manage/MenuB5', 2, 0, 1, 41),
(36, '我的账户', 'Manage/Person', 3, 0, 1, 33),
(37, '模型管理', 'Manage/Model/index', 35, 0, 1, 411),
(38, '菜单管理', 'Manage/Menu/index', 35, 0, 1, 412),
(39, '数据库管理', 'Manage/Database/index', 35, 0, 1, 413),
(40, '联动管理', 'Manage/ItemGroup/index', 35, 0, 1, 414),
(41, '区域管理', 'Manage/Area/index', 35, 0, 1, 415),
(42, '修改我的信息', 'Manage/Personal/index', 36, 0, 1, 421),
(43, '修改密码', 'Manage/Personal/pwd', 36, 0, 1, 422),
(44, '其他模块', 'Manage/MenuB4', 2, 0, 1, 22),
(45, '已传文件管理', 'Manage/Attachment/index', 35, 0, 1, 417),
(46, '数据元管理', 'Manage/Meta/index', 35, 0, 1, 416),
(47, '模板管理', 'Manage/Templets/index', 35, 0, 1, 428),
(48, 'Tag管理', 'Manage/Tag/index', 9, 0, 1, 214);

-- --------------------------------------------------------

--
-- 表的结构 `yy_model`
--

DROP TABLE IF EXISTS `yy_model`;
CREATE TABLE `yy_model` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL DEFAULT '',
  `description` varchar(255) NOT NULL DEFAULT '',
  `table_name` varchar(30) NOT NULL DEFAULT '',
  `status` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `template_category` varchar(60) NOT NULL DEFAULT '',
  `template_list` varchar(60) NOT NULL DEFAULT '',
  `template_show` varchar(60) NOT NULL DEFAULT '',
  `sort` int(10) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_model`
--

INSERT INTO `yy_model` (`id`, `name`, `description`, `table_name`, `status`, `template_category`, `template_list`, `template_show`, `sort`) VALUES
(1, '文章模型', '', 'article', 1, '', 'List_article.html', 'Show_article.html', 1),
(2, '单页模型', '', 'page', 1, '', 'List_page.html', 'Show_page.html', 2),
(3, '产品模型', '', 'product', 1, '', 'List_product.html', 'Show_product.html', 3),
(4, '图片模型', '', 'picture', 1, '', 'List_picture.html', 'Show_picture.html', 4),
(5, '软件下载模型', '', 'soft', 1, '', 'List_soft.html', 'Show_soft.html', 5);

-- --------------------------------------------------------

--
-- 表的结构 `yy_order_action`
--

DROP TABLE IF EXISTS `yy_order_action`;
CREATE TABLE `yy_order_action` (
  `id` int(10) UNSIGNED NOT NULL COMMENT '流水号',
  `order_id` varchar(30) NOT NULL,
  `order_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '订单状态',
  `distribution_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '配送状态',
  `pay_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '支付状态',
  `aid` int(10) NOT NULL DEFAULT '0',
  `note` varchar(255) NOT NULL DEFAULT '',
  `publish_time` datetime NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `yy_order_detail`
--

DROP TABLE IF EXISTS `yy_order_detail`;
CREATE TABLE `yy_order_detail` (
  `id` int(11) NOT NULL,
  `order_id` varchar(30) DEFAULT NULL COMMENT '订单ID',
  `product_id` int(11) NOT NULL DEFAULT '0',
  `user_id` int(10) NOT NULL DEFAULT '0',
  `title` varchar(100) NOT NULL DEFAULT '',
  `price` decimal(8,2) NOT NULL DEFAULT '0.00',
  `market_price` decimal(8,2) NOT NULL DEFAULT '0.00',
  `num` int(10) NOT NULL DEFAULT '1'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `yy_order_info`
--

DROP TABLE IF EXISTS `yy_order_info`;
CREATE TABLE `yy_order_info` (
  `order_id` varchar(30) NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `pay_id` tinyint(2) NOT NULL DEFAULT '1' COMMENT '支付方式',
  `express_price` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '邮费/运费',
  `prdouct_price` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '产品总价格',
  `total_price` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '总价格',
  `consignee` varchar(30) DEFAULT '' COMMENT '收件人',
  `address` varchar(255) NOT NULL DEFAULT '',
  `zip` int(10) NOT NULL DEFAULT '0',
  `tel` varchar(60) NOT NULL DEFAULT '',
  `email` varchar(100) NOT NULL DEFAULT '',
  `remark` varchar(255) NOT NULL DEFAULT '',
  `note` varchar(255) NOT NULL DEFAULT '',
  `order_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '订单状态',
  `distribution_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '配送状态',
  `pay_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '支付状态',
  `ip` varchar(15) NOT NULL DEFAULT '',
  `add_time` datetime NOT NULL COMMENT '添加时间',
  `confirm_time` datetime DEFAULT NULL COMMENT '确认时间',
  `pay_time` datetime DEFAULT NULL COMMENT '支付时间',
  `distribution_time` datetime DEFAULT NULL COMMENT '配送时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `yy_picture`
--

DROP TABLE IF EXISTS `yy_picture`;
CREATE TABLE `yy_picture` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL DEFAULT '' COMMENT '标题',
  `color` char(10) NOT NULL DEFAULT '' COMMENT '标题颜色',
  `keywords` varchar(50) DEFAULT '' COMMENT '关键字',
  `litpic` varchar(150) NOT NULL DEFAULT '' COMMENT '缩略图',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '摘要描述',
  `publish_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `update_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `copyfrom` varchar(100) NOT NULL DEFAULT '' COMMENT '来源',
  `template` varchar(30) NOT NULL DEFAULT '' COMMENT '模板',
  `picture_urls` text COMMENT '图片地址',
  `content` text COMMENT '内容',
  `click` smallint(6) UNSIGNED NOT NULL DEFAULT '0' COMMENT '点击数',
  `cid` int(10) UNSIGNED NOT NULL COMMENT '分类ID',
  `point` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '权重[越大越前]',
  `comment_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '允许评论',
  `flag` tinyint(3) UNSIGNED NOT NULL DEFAULT '0' COMMENT '属性',
  `jump_url` varchar(200) NOT NULL DEFAULT '',
  `delete_status` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '1回收站',
  `audit_status` int(10) UNSIGNED NOT NULL DEFAULT '1' COMMENT '审核状态[0未审核,1通过]',
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'admin'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_picture`
--

INSERT INTO `yy_picture` (`id`, `title`, `color`, `keywords`, `litpic`, `description`, `publish_time`, `update_time`, `copyfrom`, `template`, `picture_urls`, `content`, `click`, `cid`, `point`, `comment_flag`, `flag`, `jump_url`, `delete_status`, `audit_status`, `user_id`, `aid`) VALUES
(1, '迷幻炫彩', '', '', 'http://img9.xyhcms.com/201410/53391df14c069.jpg!200X200.jpg', '', '2014-03-31 15:49:21', '2014-03-31 15:49:21', '', '', 'http://img9.xyhcms.com/201410/53391df14c069.jpg$$$$$$|||http://img9.xyhcms.com/201410/53391deab6d3b.jpg$$$$$$|||http://img9.xyhcms.com/201410/53391dee1e3e8.jpg$$$$$$', '<p>迷幻炫彩，很好看的图片</p>', 402, 8, 100, 1, 0, '', 0, 1, 0, 1),
(2, 'gggggddd', '', '', '', '', '2017-06-17 15:41:50', '2017-06-17 16:52:07', '', '', '', '', 69, 8, 300, 1, 0, '', 0, 1, 0, 1),
(3, 'fgggg', '', '', '', '', '2017-06-17 15:42:02', '2017-06-17 15:42:07', '', '', '', '', 1, 8, 100, 1, 0, '', 0, 1, 0, 1),
(4, '5555', '', '', '', '', '2017-06-17 16:53:01', '2017-10-02 22:08:08', '', '', '', '', 92, 8, 302, 1, 0, '', 0, 1, 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_product`
--

DROP TABLE IF EXISTS `yy_product`;
CREATE TABLE `yy_product` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL DEFAULT '' COMMENT '标题',
  `color` char(10) NOT NULL DEFAULT '' COMMENT '标题颜色',
  `keywords` varchar(50) DEFAULT '' COMMENT '关键字',
  `litpic` varchar(150) NOT NULL DEFAULT '' COMMENT '缩略图',
  `picture_urls` text COMMENT '图片地址',
  `content` text COMMENT '内容',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '摘要描述',
  `publish_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `update_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `price` decimal(8,2) NOT NULL DEFAULT '0.00',
  `market_price` decimal(8,2) NOT NULL DEFAULT '0.00',
  `brand` varchar(50) NOT NULL DEFAULT '' COMMENT '品牌',
  `units` varchar(50) NOT NULL DEFAULT '' COMMENT '单位',
  `specification` varchar(50) NOT NULL DEFAULT '' COMMENT '规格',
  `click` smallint(6) UNSIGNED NOT NULL DEFAULT '0' COMMENT '点击数',
  `cid` int(10) UNSIGNED NOT NULL COMMENT '分类ID',
  `point` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '权重[越大越前]',
  `comment_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '允许评论',
  `flag` tinyint(3) UNSIGNED NOT NULL DEFAULT '0' COMMENT '属性',
  `jump_url` varchar(200) NOT NULL DEFAULT '',
  `delete_status` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '1回收站',
  `audit_status` int(10) UNSIGNED NOT NULL DEFAULT '1' COMMENT '审核状态[0未审核,1通过]',
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'admin'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_product`
--

INSERT INTO `yy_product` (`id`, `title`, `color`, `keywords`, `litpic`, `picture_urls`, `content`, `description`, `publish_time`, `update_time`, `price`, `market_price`, `brand`, `units`, `specification`, `click`, `cid`, `point`, `comment_flag`, `flag`, `jump_url`, `delete_status`, `audit_status`, `user_id`, `aid`) VALUES
(1, '皇室五件套', '', '', 'http://img9.xyhcms.com/201410/533919a874460.jpg!200X200.jpg', 'http://img9.xyhcms.com/201410/533919a874460.jpg$$$$$$', '<p>千年黄花梨</p><p>珍贵材种中国海南吊罗山黄花梨木高档实木皇室五件套尊贵经典，雕刻精密，结构稳定，其木纹如行云流水、质地坚韧缜密如玉，木色瑰丽动人.</p>', '', '2014-03-31 15:32:36', '2014-03-31 15:32:36', '0.00', '0.00', '云峰', '个', '标准', 10, 6, 100, 1, 0, '', 0, 1, 0, 1),
(2, '圆桌5件套', '', '', 'http://img9.xyhcms.com/201410/53391ad0dbbbc.jpg!200X200.jpg', 'http://img9.xyhcms.com/201410/53391ad0dbbbc.jpg$$$$$$', '<p>圆桌5件套</p><p>产地为缅甸，材质为鸡翅木</p>', '', '2014-03-31 15:35:33', '2014-03-31 15:35:33', '0.00', '0.00', '云峰', '个', '标准', 36, 6, 100, 1, 0, '', 0, 1, 0, 1),
(3, '吉象如意', '', '', 'http://img9.xyhcms.com/201410/53391bf80a62e.jpg!200X200.jpg', 'http://img9.xyhcms.com/201410/53391bf80a62e.jpg$$$$$$', '<p>阔叶黄檀，蝶形花科Fabaceae，另一拉丁学名Dalbergia emarginata Roxb是一种具备关紧经济价值的树种，在国际市场上一般叫做它为印度一种植物的花木&quot;Indian Rosewood&quot;，它主要用于制造高级家具和工艺品和扮饰材料以及医疗药品用场等。<br/>汉字学名：阔叶黄檀 <br/>拉丁学名：Fabaceae <br/>界：植物界 <br/>科：豆科 <br/>亚科：蝶形花亚科 <br/>种：黑酸枝类 <br/>散布地区范围：喜马拉雅山系以南的尼泊尔、巴基斯坦到孟加拉湾两岸。</p>', '', '2014-03-31 15:40:43', '2014-03-31 15:40:43', '0.00', '0.00', '云峰', '个', '标准', 79, 6, 100, 1, 0, '', 0, 1, 0, 1),
(4, 'gggg', '', '', '', '', '', '', '2017-06-17 15:41:19', '2017-06-17 16:51:52', '0.00', '0.00', '', '', '', 95, 5, 100, 1, 0, '', 0, 1, 0, 1),
(5, 'ggggg', '', '', '/uploads/img1/20171002/59d24661d501f.jpg!300X300.jpg', '', '', '', '2017-06-17 15:41:40', '2017-10-02 22:00:04', '0.00', '0.00', '', '', '', 0, 5, 300, 1, 1, '', 0, 1, 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_search_all`
--

DROP TABLE IF EXISTS `yy_search_all`;
CREATE TABLE `yy_search_all` (
  `id` int(10) UNSIGNED NOT NULL,
  `arc_id` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '文档id',
  `title` varchar(100) NOT NULL DEFAULT '' COMMENT '标题',
  `litpic` varchar(150) NOT NULL DEFAULT '' COMMENT '缩略图',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '摘要描述',
  `jump_url` varchar(200) NOT NULL DEFAULT '',
  `publish_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `cid` int(10) UNSIGNED NOT NULL COMMENT '分类ID',
  `model_id` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '模型id',
  `point` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '权重[越大越前]',
  `delete_status` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '1回收站',
  `audit_status` int(10) UNSIGNED NOT NULL DEFAULT '1' COMMENT '审核状态[0未审核,1通过]'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_search_all`
--

INSERT INTO `yy_search_all` (`id`, `arc_id`, `title`, `litpic`, `description`, `jump_url`, `publish_time`, `cid`, `model_id`, `point`, `delete_status`, `audit_status`) VALUES
(1, 4, '对于电商而言，比特币的未来会是什么样?', '', '随着比特币价值的急剧上涨，引起了普通大众对这个数字货币的注意，在2013年，比特币的价值就从13美元上涨到了1000美元。', '', '2014-03-31 14:02:27', 3, 1, 100, 0, 1),
(3, 5, 'Facebook披露Connectivity Labs，推进无人机计划', '', 'Facebook刚刚收购了无人机制造商Titan Aerospace，他们计划用无人机技术把互联网带到世界上任何一个角落', '', '2014-03-31 14:03:43', 3, 1, 100, 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_soft`
--

DROP TABLE IF EXISTS `yy_soft`;
CREATE TABLE `yy_soft` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL DEFAULT '' COMMENT '标题',
  `color` char(10) NOT NULL DEFAULT '' COMMENT '标题颜色',
  `keywords` varchar(50) DEFAULT '' COMMENT '关键字',
  `litpic` varchar(150) NOT NULL DEFAULT '' COMMENT '缩略图',
  `picture_urls` text,
  `content` text COMMENT '内容',
  `update_log` text COMMENT '更新日志',
  `down_link` text COMMENT '下载地址',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '摘要描述',
  `publish_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `update_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `version` varchar(20) NOT NULL DEFAULT '' COMMENT '版本号',
  `soft_type` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '软件类型',
  `copy_type` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '授权形式',
  `language` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '语言',
  `os` varchar(100) NOT NULL DEFAULT '' COMMENT '运行环境',
  `file_size` varchar(10) NOT NULL DEFAULT '' COMMENT '文件大小',
  `official_url` varchar(100) NOT NULL DEFAULT '' COMMENT '官方网站',
  `click` smallint(6) UNSIGNED NOT NULL DEFAULT '0' COMMENT '点击数',
  `cid` int(10) UNSIGNED NOT NULL COMMENT '分类ID',
  `point` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '权重[越大越前]',
  `comment_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '允许评论',
  `flag` tinyint(3) UNSIGNED NOT NULL DEFAULT '0' COMMENT '属性',
  `jump_url` varchar(200) NOT NULL DEFAULT '',
  `delete_status` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '1回收站',
  `audit_status` int(10) UNSIGNED NOT NULL DEFAULT '1' COMMENT '审核状态[0未审核,1通过]',
  `user_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'admin'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_soft`
--

INSERT INTO `yy_soft` (`id`, `title`, `color`, `keywords`, `litpic`, `picture_urls`, `content`, `update_log`, `down_link`, `description`, `publish_time`, `update_time`, `version`, `soft_type`, `copy_type`, `language`, `os`, `file_size`, `official_url`, `click`, `cid`, `point`, `comment_flag`, `flag`, `jump_url`, `delete_status`, `audit_status`, `user_id`, `aid`) VALUES
(1, '王', '', '', '', NULL, '', '', '', '', '2017-06-17 15:43:43', '2017-06-17 00:00:00', '', 1, 0, 1, '', '', '', 48, 12, 100, 1, 0, '', 0, 1, 0, 1),
(2, 'fffffff土rr', '#7a0045', '444', '/uploads/img1/20171002/59d22b1bb0383.jpg', NULL, '<p>333333333333</p>', '3333333333', '本地下载$$$/uploads/file1/20171006/59d767731aa89.txt\r|||', '333', '2017-06-17 00:00:00', '2017-06-21 00:00:00', '3', 1, 0, 1, 'Win7 Win832 WinNT', '0.19KB', '', 0, 12, 300, 1, 1, '', 0, 1, 0, 1),
(3, '44rffff', '', '', '', NULL, '', '', '', '', '2017-06-17 16:52:23', '2017-06-17 00:00:00', '', 1, 0, 1, '', '', '', 52, 12, 100, 1, 0, '', 0, 1, 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_special`
--

DROP TABLE IF EXISTS `yy_special`;
CREATE TABLE `yy_special` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL DEFAULT '',
  `short_title` varchar(100) NOT NULL DEFAULT '' COMMENT '副标题',
  `color` char(10) NOT NULL DEFAULT '',
  `author` varchar(30) NOT NULL DEFAULT '',
  `keywords` varchar(50) DEFAULT '' COMMENT '关键字',
  `litpic` varchar(150) NOT NULL DEFAULT '' COMMENT '缩略图',
  `description` varchar(255) NOT NULL DEFAULT '',
  `publish_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '发布时间',
  `update_time` datetime NOT NULL DEFAULT '1900-01-01 00:00:00' COMMENT '更新时间',
  `content` text COMMENT '内容',
  `click` smallint(6) UNSIGNED NOT NULL DEFAULT '0' COMMENT '点击数',
  `cid` int(10) UNSIGNED NOT NULL COMMENT '分类ID',
  `point` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '权重[越大越前]',
  `comment_flag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '允许评论',
  `flag` tinyint(3) UNSIGNED NOT NULL DEFAULT '0' COMMENT '属性',
  `jump_url` varchar(200) NOT NULL DEFAULT '',
  `delete_status` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '1回收站',
  `audit_status` int(10) UNSIGNED NOT NULL DEFAULT '1' COMMENT '审核状态[0未审核,1通过]',
  `filename` varchar(60) DEFAULT '',
  `template` varchar(60) NOT NULL DEFAULT '',
  `aid` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT 'admin'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_special`
--

INSERT INTO `yy_special` (`id`, `title`, `short_title`, `color`, `author`, `keywords`, `litpic`, `description`, `publish_time`, `update_time`, `content`, `click`, `cid`, `point`, `comment_flag`, `flag`, `jump_url`, `delete_status`, `audit_status`, `filename`, `template`, `aid`) VALUES
(1, '文章汇集', '', '', '', '', 'http://img9.xyhcms.com/201410/53391df14c069.jpg!200X200.jpg', '文章汇集', '2014-04-28 15:01:49', '2017-10-03 08:52:06', '', 82, 1, 200, 1, 1, '', 0, 1, '', 'Special_content.html', 1),
(2, 'ffff', '', '', '', '', '', '', '2017-06-17 16:54:56', '2017-10-03 09:00:42', '', 56, 3, 4, 1, 0, '', 0, 1, '', 'Special_content.html', 1);

-- --------------------------------------------------------

--
-- 表的结构 `yy_tag`
--

DROP TABLE IF EXISTS `yy_tag`;
CREATE TABLE `yy_tag` (
  `id` int(10) UNSIGNED NOT NULL,
  `tag_name` varchar(30) NOT NULL DEFAULT '',
  `num` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '文档数',
  `hit` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '点击数',
  `sort` int(10) UNSIGNED NOT NULL DEFAULT '100' COMMENT '排序',
  `add_time` datetime NOT NULL COMMENT '更新时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_tag`
--

INSERT INTO `yy_tag` (`id`, `tag_name`, `num`, `hit`, `sort`, `add_time`) VALUES
(1, '比特币', 1, 0, 100, '2017-10-16 18:25:23'),
(2, '支付平台', 2, 0, 100, '2017-10-16 18:25:23'),
(3, '无人机', 1, 0, 100, '2017-10-16 18:26:23'),
(5, '666', 0, 0, 100, '2017-10-17 18:41:17'),
(6, '天才', 0, 0, 100, '2017-10-17 21:58:09'),
(7, '天使', 0, 0, 100, '2017-10-17 22:04:19');

-- --------------------------------------------------------

--
-- 表的结构 `yy_tag_index`
--

DROP TABLE IF EXISTS `yy_tag_index`;
CREATE TABLE `yy_tag_index` (
  `tag_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `arc_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `cid` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `model_id` int(10) UNSIGNED NOT NULL DEFAULT '0' COMMENT '模型id'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `yy_tag_index`
--

INSERT INTO `yy_tag_index` (`tag_id`, `arc_id`, `cid`, `model_id`) VALUES
(2, 4, 3, 1),
(1, 4, 3, 1),
(3, 5, 3, 1),
(2, 5, 3, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `yy_abc`
--
ALTER TABLE `yy_abc`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_abc_detail`
--
ALTER TABLE `yy_abc_detail`
  ADD PRIMARY KEY (`id`),
  ADD KEY `aid` (`aid`);

--
-- Indexes for table `yy_active`
--
ALTER TABLE `yy_active`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`) USING BTREE;

--
-- Indexes for table `yy_admin`
--
ALTER TABLE `yy_admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_announce`
--
ALTER TABLE `yy_announce`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_area`
--
ALTER TABLE `yy_area`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_article`
--
ALTER TABLE `yy_article`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cid` (`cid`);

--
-- Indexes for table `yy_attachment`
--
ALTER TABLE `yy_attachment`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_attachment_index`
--
ALTER TABLE `yy_attachment_index`
  ADD KEY `att_id` (`att_id`) USING BTREE,
  ADD KEY `arc_id` (`arc_id`) USING BTREE,
  ADD KEY `model_id` (`model_id`) USING BTREE;

--
-- Indexes for table `yy_auth_group`
--
ALTER TABLE `yy_auth_group`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_auth_group_access`
--
ALTER TABLE `yy_auth_group_access`
  ADD UNIQUE KEY `uid_group_id` (`uid`,`group_id`),
  ADD KEY `uid` (`uid`),
  ADD KEY `group_id` (`group_id`);

--
-- Indexes for table `yy_auth_rule`
--
ALTER TABLE `yy_auth_rule`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `yy_category`
--
ALTER TABLE `yy_category`
  ADD PRIMARY KEY (`id`),
  ADD KEY `pid` (`pid`);

--
-- Indexes for table `yy_category_access`
--
ALTER TABLE `yy_category_access`
  ADD KEY `catid` (`cat_id`),
  ADD KEY `roleid` (`role_id`),
  ADD KEY `flag` (`flag`);

--
-- Indexes for table `yy_comment`
--
ALTER TABLE `yy_comment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `pid` (`pid`),
  ADD KEY `post_id` (`post_id`) USING BTREE,
  ADD KEY `model_id` (`model_id`) USING BTREE;

--
-- Indexes for table `yy_config`
--
ALTER TABLE `yy_config`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`),
  ADD KEY `type_id` (`type_id`) USING BTREE,
  ADD KEY `group_id` (`group_id`) USING BTREE;

--
-- Indexes for table `yy_copyfrom`
--
ALTER TABLE `yy_copyfrom`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_department`
--
ALTER TABLE `yy_department`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_free_block`
--
ALTER TABLE `yy_free_block`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_guestbook`
--
ALTER TABLE `yy_guestbook`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_item_group`
--
ALTER TABLE `yy_item_group`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_item_info`
--
ALTER TABLE `yy_item_info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_link`
--
ALTER TABLE `yy_link`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_member`
--
ALTER TABLE `yy_member`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_member_detail`
--
ALTER TABLE `yy_member_detail`
  ADD PRIMARY KEY (`user_id`);

--
-- Indexes for table `yy_member_group`
--
ALTER TABLE `yy_member_group`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_menu`
--
ALTER TABLE `yy_menu`
  ADD PRIMARY KEY (`id`),
  ADD KEY `pid` (`pid`);

--
-- Indexes for table `yy_model`
--
ALTER TABLE `yy_model`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_order_action`
--
ALTER TABLE `yy_order_action`
  ADD PRIMARY KEY (`id`),
  ADD KEY `orderid` (`order_id`);

--
-- Indexes for table `yy_order_detail`
--
ALTER TABLE `yy_order_detail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_order_info`
--
ALTER TABLE `yy_order_info`
  ADD PRIMARY KEY (`order_id`),
  ADD KEY `add_time` (`add_time`) USING BTREE;

--
-- Indexes for table `yy_picture`
--
ALTER TABLE `yy_picture`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cid` (`cid`);

--
-- Indexes for table `yy_product`
--
ALTER TABLE `yy_product`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cid` (`cid`);

--
-- Indexes for table `yy_search_all`
--
ALTER TABLE `yy_search_all`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_soft`
--
ALTER TABLE `yy_soft`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cid` (`cid`);

--
-- Indexes for table `yy_special`
--
ALTER TABLE `yy_special`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cid` (`cid`);

--
-- Indexes for table `yy_tag`
--
ALTER TABLE `yy_tag`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `yy_tag_index`
--
ALTER TABLE `yy_tag_index`
  ADD PRIMARY KEY (`tag_id`,`arc_id`,`cid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `yy_abc`
--
ALTER TABLE `yy_abc`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_abc_detail`
--
ALTER TABLE `yy_abc_detail`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `yy_active`
--
ALTER TABLE `yy_active`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_admin`
--
ALTER TABLE `yy_admin`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_announce`
--
ALTER TABLE `yy_announce`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_article`
--
ALTER TABLE `yy_article`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
--
-- 使用表AUTO_INCREMENT `yy_attachment`
--
ALTER TABLE `yy_attachment`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
--
-- 使用表AUTO_INCREMENT `yy_auth_group`
--
ALTER TABLE `yy_auth_group`
  MODIFY `id` mediumint(9) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `yy_auth_rule`
--
ALTER TABLE `yy_auth_rule`
  MODIFY `id` mediumint(8) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '规则id,自增主键', AUTO_INCREMENT=160;
--
-- 使用表AUTO_INCREMENT `yy_category`
--
ALTER TABLE `yy_category`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;
--
-- 使用表AUTO_INCREMENT `yy_comment`
--
ALTER TABLE `yy_comment`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_config`
--
ALTER TABLE `yy_config`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;
--
-- 使用表AUTO_INCREMENT `yy_copyfrom`
--
ALTER TABLE `yy_copyfrom`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `yy_department`
--
ALTER TABLE `yy_department`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=5;
--
-- 使用表AUTO_INCREMENT `yy_free_block`
--
ALTER TABLE `yy_free_block`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_guestbook`
--
ALTER TABLE `yy_guestbook`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
--
-- 使用表AUTO_INCREMENT `yy_item_group`
--
ALTER TABLE `yy_item_group`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- 使用表AUTO_INCREMENT `yy_item_info`
--
ALTER TABLE `yy_item_info`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;
--
-- 使用表AUTO_INCREMENT `yy_link`
--
ALTER TABLE `yy_link`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `yy_member`
--
ALTER TABLE `yy_member`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_member_group`
--
ALTER TABLE `yy_member_group`
  MODIFY `id` smallint(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `yy_menu`
--
ALTER TABLE `yy_menu`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;
--
-- 使用表AUTO_INCREMENT `yy_model`
--
ALTER TABLE `yy_model`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- 使用表AUTO_INCREMENT `yy_order_action`
--
ALTER TABLE `yy_order_action`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '流水号';
--
-- 使用表AUTO_INCREMENT `yy_order_detail`
--
ALTER TABLE `yy_order_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `yy_picture`
--
ALTER TABLE `yy_picture`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- 使用表AUTO_INCREMENT `yy_product`
--
ALTER TABLE `yy_product`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
--
-- 使用表AUTO_INCREMENT `yy_search_all`
--
ALTER TABLE `yy_search_all`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- 使用表AUTO_INCREMENT `yy_soft`
--
ALTER TABLE `yy_soft`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `yy_special`
--
ALTER TABLE `yy_special`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `yy_tag`
--
ALTER TABLE `yy_tag`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
